zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp131cxx_ca7.h
}EXTI_TypeDef;

typedef struct
{
  __IO uint32_t IMR1;                /*!< EXTI Interrupt mask register,                Address offset: 0x00 */
  __IO uint32_t EMR1;                /*!< EXTI Event mask register,                    Address offset: 0x04 */
  uint32_t      RESERVED1[2];        /*!< Reserved, offset 0x08 -> 0x10                                     */
  __IO uint32_t IMR2;                /*!< EXTI Interrupt mask register,                Address offset: 0x10 */
  __IO uint32_t EMR2;                /*!< EXTI Event mask register,                    Address offset: 0x14 */
  uint32_t      RESERVED2[2];        /*!< Reserved, offset 0x18 -> 0x20                                     */
  __IO uint32_t IMR3;                /*!< EXTI Interrupt mask register,                Address offset: 0x20 */
  __IO uint32_t EMR3;                /*!< EXTI Event mask register,                    Address offset: 0x24 */
  uint32_t      RESERVED3[6];        /*!< Reserved, offset 0x28 -> 0x40                                     */
}EXTI_Core_TypeDef;


/**
  * @brief Flexible Memory Controller
  */

typedef struct
{
  __IO uint32_t BTCR[8];    /*!< NOR/PSRAM chip-select control register(BCR) and chip-select timing register(BTR), Address offset: 0x00-1C */
  __IO uint32_t PCSCNTR;    /*!< PSRAM chip-select counter register(PCSCNTR),                                      Address offset: 0x20 */
} FMC_Bank1_TypeDef;

/**
  * @brief Flexible Memory Controller Bank1E
  */

typedef struct
{
  __IO uint32_t BWTR[7];    /*!< NOR/PSRAM write timing registers, Address offset: 0x104-0x11C */
} FMC_Bank1E_TypeDef;

/**
  * @brief Flexible Memory Controller Bank3
  */

typedef struct
{
  __IO uint32_t PCR;             /*!< NAND Flash Programmable control register               Address offset: 0x080 */
  __IO uint32_t SR;              /*!< FMC status register                                    Address offset: 0x084 */
  __IO uint32_t PMEM;            /*!< Common memory space timing register                    Address offset: 0x088 */
  __IO uint32_t PATT;            /*!< Attribute memory space timing registers                Address offset: 0x08C */
  __IO uint32_t HPR;             /*!< FMC Hamming parity result registers                    Address offset: 0x090 */
  __IO uint32_t HECCR;           /*!< FMC Hamming code ECC result register                   Address offset: 0x094 */
       uint32_t RESERVED0[58];   /*!< Reserved                                               Address offset: 0x098-0x17C */
  __IO uint32_t IER;             /*!< FMC NAND Interrupt Enable Register                     Address offset: 0x180 */
  __IO uint32_t ISR;             /*!< FMC Controller Interrupt Status Register               Address offset: 0x184 */
  __IO uint32_t ICR;             /*!< FMC NAND Controller Interrupt Clear Register           Address offset: 0x188 */
       uint32_t RESERVED1[29];   /*!< Reserved                                               Address offset: 0x18C-0x1FC */
  __IO uint32_t CSQCR;           /*!< FMC NAND Command Sequencer Control Register            Address offset: 0x200 */
  __IO uint32_t CSQCFGR1;        /*!< FMC NAND Command Sequencer Configuration Register 1    Address offset: 0x204 */
  __IO uint32_t CSQCFGR2;        /*!< FMC NAND Command Sequencer Configuration Register 2    Address offset: 0x208 */
  __IO uint32_t CSQCFGR3;        /*!< FMC NAND sequencer configuration register 3            Address offset: 0x20C */
  __IO uint32_t CSQAR1;          /*!< FMC NAND Command Sequencer Address Register 1          Address offset: 0x210 */
  __IO uint32_t CSQAR2;          /*!< FMC NAND Command Sequencer Address Register 2          Address offset: 0x214 */
       uint32_t RESERVED2[2];    /*!< Reserved                                               Address offset: 0x218-0x21C */
  __IO uint32_t CSQIER;          /*!< FMC NAND Command Sequencer Interrupt Enable Register   Address offset: 0x220 */
  __IO uint32_t CSQISR;          /*!< FMC NAND Command Sequencer Interrupt Status Register   Address offset: 0x224 */
  __IO uint32_t CSQICR;          /*!< FMC NAND Command Sequencer Interrupt Clear Register    Address offset: 0x228 */
       uint32_t RESERVED3;       /*!< Reserved                                               Address offset: 0x22C */
  __IO uint32_t CSQEMSR;         /*!< FMC Command Sequencer Error Mapping Status register    Address offset: 0x230 */
       uint32_t RESERVED4[7];    /*!< Reserved                                               Address offset: 0x234-0x24C */
  __IO uint32_t BCHIER;          /*!< FMC BCH Interrupt enable register                      Address offset: 0x250 */
  __IO uint32_t BCHISR;          /*!< FMC BCH Interrupt and Status Register                  Address offset: 0x254 */
  __IO uint32_t BCHICR;          /*!< FMC BCH Interrupt Clear Register                       Address offset: 0x258 */
       uint32_t RESERVED5;       /*!< Reserved                                               Address offset: 0x25C */
  __IO uint32_t BCHPBR1;         /*!< FMC BCH Parity Bits Register 1                         Address offset: 0x260 */
  __IO uint32_t BCHPBR2;         /*!< FMC BCH Parity Bits Register 2                         Address offset: 0x264 */
  __IO uint32_t BCHPBR3;         /*!< FMC BCH Parity Bits Register 3                         Address offset: 0x268 */
  __IO uint32_t BCHPBR4;         /*!< FMC BCH Parity Bits Register 4                         Address offset: 0x26C */
       uint32_t RESERVED6[3];    /*!< Reserved                                               Address offset: 0x270-0x278 */
  __IO uint32_t BCHDSR0;         /*!< FMC BCH Decoder Status register 0                      Address offset: 0x27C */
  __IO uint32_t BCHDSR1;         /*!< FMC BCH Decoder Status register for bank 1             Address offset: 0x280 */
  __IO uint32_t BCHDSR2;         /*!< FMC BCH Decoder Status register for bank 2             Address offset: 0x284 */
  __IO uint32_t BCHDSR3;         /*!< FMC BCH Decoder Status register for bank 3             Address offset: 0x288 */
  __IO uint32_t BCHDSR4;         /*!< FMC BCH Decoder Status register for bank 4             Address offset: 0x28C */
       uint32_t RESERVED7[87];   /*!< Reserved,                                              Address offset: 0x28C->0x3EC */
  __IO uint32_t HWCFGR2;         /*!< FMC HW Configuration register 2,                       Address offset: 0x3EC */
  __IO uint32_t HWCFGR1;         /*!< FMC HW Configuration register 1,                       Address offset: 0x3F0 */
  __IO uint32_t VERR;            /*!< FMC Version register ,                                 Address offset: 0x3F4 */
  __IO uint32_t IDR;             /*!< FMC Identification register ,                          Address offset: 0x3F8 */
  __IO uint32_t SIDR;            /*!< FMC Size ID register ,                                 Address offset: 0x3FC */
} FMC_Bank3_TypeDef;


/**
  * @brief General Purpose I/O
  */

typedef struct
{
  __IO uint32_t MODER;           /*!< GPIO port mode register,                      Address offset: 0x000 */
  __IO uint32_t OTYPER;          /*!< GPIO port output type register,               Address offset: 0x004 */
  __IO uint32_t OSPEEDR;         /*!< GPIO port output speed register,              Address offset: 0x008 */
  __IO uint32_t PUPDR;           /*!< GPIO port pull-up/pull-down register,         Address offset: 0x00C */
  __IO uint32_t IDR;             /*!< GPIO port input data register,                Address offset: 0x010 */
  __IO uint32_t ODR;             /*!< GPIO port output data register,               Address offset: 0x014 */
  __IO uint32_t BSRR;            /*!< GPIO port bit set/reset register,             Address offset: 0x018 */
  __IO uint32_t LCKR;            /*!< GPIO port configuration lock register,        Address offset: 0x01C */
  __IO uint32_t AFR[2];          /*!< GPIO alternate function registers,            Address offset: 0x020-0x024 */
  __IO uint32_t BRR;             /*!< GPIO port bit reset register,                 Address offset: 0x028 */
       uint32_t RESERVED0;       /*!< Reserved,                                     Address offset: 0x02C */
  __IO uint32_t SECCFGR;         /*!< GPIO secure configuration register for GPIOZ, Address offset: 0x030 */
       uint32_t RESERVED1[229];  /*!< Reserved,                                     Address offset: 0x034-0x3C4 */
  __IO uint32_t HWCFGR10;        /*!< GPIO hardware configuration register 10,      Address offset: 0x3C8 */
  __IO uint32_t HWCFGR9;         /*!< GPIO hardware configuration register 9,       Address offset: 0x3CC */
  __IO uint32_t HWCFGR8;         /*!< GPIO hardware configuration register 8,       Address offset: 0x3D0 */
  __IO uint32_t HWCFGR7;         /*!< GPIO hardware configuration register 7,       Address offset: 0x3D4 */
  __IO uint32_t HWCFGR6;         /*!< GPIO hardware configuration register 6,       Address offset: 0x3D8 */
  __IO uint32_t HWCFGR5;         /*!< GPIO hardware configuration register 5,       Address offset: 0x3DC */
  __IO uint32_t HWCFGR4;         /*!< GPIO hardware configuration register 4,       Address offset: 0x3E0 */
  __IO uint32_t HWCFGR3;         /*!< GPIO hardware configuration register 3,       Address offset: 0x3E4 */
  __IO uint32_t HWCFGR2;         /*!< GPIO hardware configuration register 2,       Address offset: 0x3E8 */
  __IO uint32_t HWCFGR1;         /*!< GPIO hardware configuration register 1,       Address offset: 0x3EC */
  __IO uint32_t HWCFGR0;         /*!< GPIO hardware configuration register 0,       Address offset: 0x3F0 */
  __IO uint32_t VERR;            /*!< GPIO version register,                        Address offset: 0x3F4 */
  __IO uint32_t IPIDR;           /*!< GPIO identification register,                 Address offset: 0x3F8 */
  __IO uint32_t SIDR;            /*!< GPIO size identification register,            Address offset: 0x3FC */
} GPIO_TypeDef;


/**
  * @brief System configuration controller
  */

typedef struct
{
  __IO uint32_t BOOTR;          /*!< SYSCFG Boot pin control register,                                Address offset: 0x00        */
  __IO uint32_t PMCSETR;        /*!< SYSCFG Peripheral Mode configuration set register,               Address offset: 0x04        */
  __IO uint32_t PMCCLRR;        /*!< SYSCFG Peripheral Mode configuration clear register,             Address offset: 0x08        */
  __IO uint32_t BOOTCR;         /*!< SYSCFG Boot control register,                                    Address offset: 0x0C        */
  __IO uint32_t SRAM3ERASER;    /*!< SYSCFG SRAM3 erase register,                                     Address offset: 0x10        */
  __IO uint32_t SRAM3KR;        /*!< SYSCFG SRAM3 erase key register,                                 Address offset: 0x14        */
       uint32_t RESERVED1[2];   /*!< Reserved,                                                        Address offset: 0x18-0x1C   */
  __IO uint32_t CMPCR;          /*!< SYSCFG main compensation cell control register,                  Address offset: 0x20        */
  __IO uint32_t CMPENSETR;      /*!< SYSCFG main compensation cell enable set register,               Address offset: 0x24        */
  __IO uint32_t CMPENCLRR;      /*!< SYSCFG main compensation cell enable clear register,             Address offset: 0x28        */
  __IO uint32_t CBR;            /*!< SYSCFG control timer break register,                             Address offset: 0x2C        */
  __IO uint32_t CMPSD1CR;       /*!< SYSCFG SDMMC1 compensation cell control register,                Address offset: 0x30        */
  __IO uint32_t CMPSD1ENSETR;   /*!< SYSCFG SDMMC1 compensation cell enable set register,             Address offset: 0x34        */
  __IO uint32_t CMPSD1ENCLRR;   /*!< SYSCFG SDMMC1 compensation cell enable clear register,           Address offset: 0x38        */
       uint32_t RESERVED2;      /*!< Reserved,                                                        Address offset: 0x3C        */
  __IO uint32_t CMPSD2CR;       /*!< SYSCFG SDMMC2 compensation cell control register,                Address offset: 0x40        */
  __IO uint32_t CMPSD2ENSETR;   /*!< SYSCFG SDMMC2 compensation cell enable set register,             Address offset: 0x44        */
  __IO uint32_t CMPSD2ENCLRR;   /*!< SYSCFG SDMMC2 compensation cell enable clear register,           Address offset: 0x48        */
  uint32_t RESERVED3;           /*!< Reserved,                                                        Address offset: 0x4C        */
  __IO uint32_t HSLVEN0R;       /*!< SYSCFG HSLV enable register 0,                                   Address offset: 0x50        */
  __IO uint32_t HSLVEN1R;       /*!< SYSCFG HSLV enable register 1,                                   Address offset: 0x54        */
  __IO uint32_t HSLVEN2R;       /*!< SYSCFG HSLV enable register 2,                                   Address offset: 0x58        */
  __IO uint32_t HSLVEN3R;       /*!< SYSCFG HSLV enable register 3,                                   Address offset: 0x5C        */
  __IO uint32_t HSLVEN4R;       /*!< SYSCFG HSLV enable register 4,                                   Address offset: 0x60        */
  __IO uint32_t HSLVEN5R;       /*!< SYSCFG HSLV enable register 5,                                   Address offset: 0x64        */
  __IO uint32_t HSLVEN6R;       /*!< SYSCFG HSLV enable register 6,                                   Address offset: 0x68        */
  __IO uint32_t HSLVEN7R;       /*!< SYSCFG HSLV enable register 7,                                   Address offset: 0x6C        */
  __IO uint32_t HSLVEN8R;       /*!< SYSCFG HSLV enable register 8,                                   Address offset: 0x70        */
  __IO uint32_t HSLVEN9R;       /*!< SYSCFG HSLV enable register 9,                                   Address offset: 0x74        */
  __IO uint32_t HSLVEN10R;      /*!< SYSCFG HSLV enable register 10,                                  Address offset: 0x78        */
  __IO uint32_t HSLVEN11R;      /*!< SYSCFG HSLV enable register 11,                                  Address offset: 0x7C        */
  uint32_t RESERVED4[192];      /*!< Reserved,                                                        Address offset: 0x80-0x37C  */
  __IO uint32_t IDCR;           /*!< SYSCFG identity code register,                                   Address offset: 0x380       */
  uint32_t RESERVED5[28];      /*!< Reserved,                                                         Address offset: 0x384-0x3F0 */
  __IO uint32_t VERR;           /*!< SYSCFG version register,                                         Address offset: 0x3F4       */
  __IO uint32_t IPIDR;          /*!< SYSCFG ID register,                                              Address offset: 0x3F8       */
  __IO uint32_t SIDR;           /*!< SYSCFG magic ID register,                                        Address offset: 0x3FC       */
} SYSCFG_TypeDef;


/**
  * @briefVoltage reference buffer
  */
typedef struct
{
  __IO uint32_t CSR;                /*VREF control and status register                      Address offset: 0x00      */
  __IO uint32_t CCR;                /*VREF control and status register                      Address offset: 0x04      */
} VREF_TypeDef;


/**
  * @brief Inter-integrated Circuit Interface
  */

typedef struct
{
  __IO uint32_t CR1;      /*!< I2C Control register 1,            Address offset: 0x00 */
  __IO uint32_t CR2;      /*!< I2C Control register 2,            Address offset: 0x04 */
  __IO uint32_t OAR1;     /*!< I2C Own address 1 register,        Address offset: 0x08 */
  __IO uint32_t OAR2;     /*!< I2C Own address 2 register,        Address offset: 0x0C */
  __IO uint32_t TIMINGR;  /*!< I2C Timing register,               Address offset: 0x10 */
  __IO uint32_t TIMEOUTR; /*!< I2C Timeout register,              Address offset: 0x14 */
  __IO uint32_t ISR;      /*!< I2C Interrupt and status register, Address offset: 0x18 */
  __IO uint32_t ICR;      /*!< I2C Interrupt clear register,      Address offset: 0x1C */
  __IO uint32_t PECR;     /*!< I2C PEC register,                  Address offset: 0x20 */
  __IO uint32_t RXDR;     /*!< I2C Receive data register,         Address offset: 0x24 */
  __IO uint32_t TXDR;     /*!< I2C Transmit data register,        Address offset: 0x28 */
  uint32_t RESERVED[241]; /*!< Reserved, 0x2C->0x3F0 */
  __IO uint32_t HWCFGR;   /*!< I2C hardware configuration register,  Address offset: 0x3F0 */
  __IO uint32_t VERR;     /*!< I2C version register,                 Address offset: 0x3F4 */
  __IO uint32_t IPIDR;    /*!< I2C identification register,          Address offset: 0x3F8 */
  __IO uint32_t SIDR;     /*!< I2C size identification register,     Address offset: 0x3FC */
} I2C_TypeDef;

/**
  * @brief Independent WATCHDOG
  */

typedef struct
{
  __IO uint32_t KR;   /*!< IWDG Key register,                          Address offset: 0x00 */
  __IO uint32_t PR;   /*!< IWDG Prescaler register,                    Address offset: 0x04 */
  __IO uint32_t RLR;  /*!< IWDG Reload register,                       Address offset: 0x08 */
  __IO uint32_t SR;   /*!< IWDG Status register,                       Address offset: 0x0C */
  __IO uint32_t WINR; /*!< IWDG Window register,                       Address offset: 0x10 */
  __IO uint32_t EWCR; /*!< IWDG Window register,                       Address offset: 0x14 */
  uint32_t RESERVED[246]; /*!< Reserved,                                        0x18->0x3EC */
  __IO uint32_t HWCFGR;   /*!< IWDG hardware configuration register,  Address offset: 0x3F0 */
  __IO uint32_t VERR;     /*!< IWDG version register,                 Address offset: 0x3F4 */
  __IO uint32_t IDR;    /*!< IWDG identification register,            Address offset: 0x3F8 */
  __IO uint32_t SIDR;     /*!< IWDG size identification register,     Address offset: 0x3FC */
} IWDG_TypeDef;


/**
  * @brief SAES hardware accelerator
  */
typedef struct
{
  __IO uint32_t CR;          /*!< SAES control register,                        Address offset: 0x00 */
  __IO uint32_t SR;          /*!< SAES status register,                         Address offset: 0x04 */
  __IO uint32_t DINR;        /*!< SAES data input register,                     Address offset: 0x08 */
  __IO uint32_t DOUTR;       /*!< SAES data output register,                    Address offset: 0x0C */
  __IO uint32_t KEYR0;       /*!< SAES key register 0,                          Address offset: 0x10 */
  __IO uint32_t KEYR1;       /*!< SAES key register 1,                          Address offset: 0x14 */
  __IO uint32_t KEYR2;       /*!< SAES key register 2,                          Address offset: 0x18 */
  __IO uint32_t KEYR3;       /*!< SAES key register 3,                          Address offset: 0x1C */
  __IO uint32_t IVR0;        /*!< SAES initialization vector register 0,        Address offset: 0x20 */
  __IO uint32_t IVR1;        /*!< SAES initialization vector register 1,        Address offset: 0x24 */
  __IO uint32_t IVR2;        /*!< SAES initialization vector register 2,        Address offset: 0x28 */
  __IO uint32_t IVR3;        /*!< SAES initialization vector register 3,        Address offset: 0x2C */
  __IO uint32_t KEYR4;       /*!< SAES key register 4,                          Address offset: 0x30 */
  __IO uint32_t KEYR5;       /*!< SAES key register 5,                          Address offset: 0x34 */
  __IO uint32_t KEYR6;       /*!< SAES key register 6,                          Address offset: 0x38 */
  __IO uint32_t KEYR7;       /*!< SAES key register 7,                          Address offset: 0x3C */
  __IO uint32_t SUSP0R;      /*!< SAES suspend registers 0,                     Address offset: 0x40 */
  __IO uint32_t SUSP1R;      /*!< SAES suspend registers 1,                     Address offset: 0x44 */
  __IO uint32_t SUSP2R;      /*!< SAES suspend registers 2,                     Address offset: 0x48 */
  __IO uint32_t SUSP3R;      /*!< SAES suspend registers 3,                     Address offset: 0x4c */
  __IO uint32_t SUSP4R;      /*!< SAES suspend registers 4,                     Address offset: 0x50 */
  __IO uint32_t SUSP5R;      /*!< SAES suspend registers 5,                     Address offset: 0x54 */
  __IO uint32_t SUSP6R;      /*!< SAES suspend registers 6,                     Address offset: 0x58 */
  __IO uint32_t SUSP7R;      /*!< SAES suspend registers 7,                     Address offset: 0x5c */
  uint32_t RESERVED1[40];    /*!< Reserved,                                     Address offset: 0x60 -- 0xFC */
  __IO uint32_t DPACFGR;     /*!< SAES IP DPACFGR register,                     Address offset: 0x0100 */
  uint32_t RESERVED2[127];   /*!< Reserved,                                     Address offset: 0x104 -- 0x2FC */
  __IO uint32_t IER;         /*!< SAES Interrupt Enable Register,               Address offset: 0x0300 */
  __IO uint32_t ISR;         /*!< SAES Interrupt Status Register,               Address offset: 0x0304 */
  __IO uint32_t ICR;         /*!< SAES Interrupt Clear Register,                Address offset: 0x0308 */
  uint32_t RESERVED3[57];   /*!< Reserved,                                      Address offset: 0x30C -- 0x3EC */
  __IO uint32_t HWCFGR;      /*!< SAES HW Configuration Register,               Address offset: 0x3F0 */
  __IO uint32_t VERR;        /*!< SAES Version Register,                        Address offset: 0x3F4 */
  __IO uint32_t IPIDR;       /*!< SAES Identification Register,                 Address offset: 0x3F8 */
  __IO uint32_t SIDR;        /*!< SAES Size ID Register,                        Address offset: 0x3FC */
} SAES_TypeDef;

 
 /**
  * @brief Public Key Accelerator (PKA)
  */
#define PKA_RAM_SIZE (5336U/4U)
typedef struct
{
  __IO uint32_t CR;          /*!< PKA control register,                 Address offset: 0x00 */
  __IO uint32_t SR;          /*!< PKA status register,                  Address offset: 0x04 */
  __IO uint32_t CLRFR;       /*!< PKA clear flag register,              Address offset: 0x08 */
  uint32_t  Reserved1[253];  /*!< Reserved                              Address offset: 0x000C-0x03FC*/
  __IO uint32_t RAM[PKA_RAM_SIZE];   /*!< PKA RAM,                      Address offset: 0x0400-0xXXXX */
  uint32_t  Reserved2[1788-PKA_RAM_SIZE];  /*!< Reserved                Address offset: (0xXXXX+4)-0x1FEF*/
  __IO uint32_t HWCFGR;      /*!< PKA configuration register,           Address offset: 0x1FF0 */
  __IO uint32_t VERR;        /*!< PKA version register,                 Address offset: 0x1FF4 */
  __IO uint32_t ID;          /*!< PKA ID register,                      Address offset: 0x1FF8 */
} PKA_TypeDef;

