zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp131cxx_ca7.h
/**
  * @brief MCE Memory Cipher Engine
  */
typedef struct
{
  __IO uint32_t CR;                        /*!< MCE Configuration Register,               Address offset: 0x000 */
  __IO uint32_t SR;                        /*!< MCE Status Register,                      Address offset: 0x004 */
  __IO uint32_t IASR;                      /*!< MCE Illegal Access Status Register,       Address offset: 0x008 */
  __IO uint32_t IACR;                      /*!< MCE Illegal Access Clear Register,        Address offset: 0x00C */
  __IO uint32_t IAIER;                     /*!< MCE Illegal Interrupt Enable Register,    Address offset: 0x010 */
  uint32_t RESERVED0[2];                   /*! Reserved                                   Address offset: 0x014 - 0x018 */
  __IO uint32_t PRIVCFGR;                  /*!< MCE Privileged Configuration Register,    Address offset: 0x01C */
  uint32_t RESERVED1[8];                   /*! Reserved                                   Address offset: 0x020 - 0x03C */
  __IO uint32_t REGCR;                     /*!< MCE Region X Configuration Register,      Address offset: 0x040 */
  __IO uint32_t SADDR;                     /*!< MCE Start Address For Region X Register,  Address offset: 0x044 */
  __IO uint32_t EADDR;                     /*!< MCE End Address For Region X Register,    Address offset: 0x048 */
  uint32_t RESERVED2[109];                 /*! Reserved                                   Address offset: 0x04C - 0x1FC */
  __IO uint32_t MKEYR0;                    /*!< MCE Master Key 0 Register,                Address offset: 0x200 */
  __IO uint32_t MKEYR1;                    /*!< MCE Master Key 1 Register,                Address offset: 0x204 */
  __IO uint32_t MKEYR2;                    /*!< MCE Master Key 2 Register,                Address offset: 0x208 */
  __IO uint32_t MKEYR3;                    /*!< MCE Master Key 3 Register,                Address offset: 0x20C */
  uint32_t RESERVED3[118];                 /*! Reserved                                   Address offset: 0x210 - 0x3E4 */
  __IO uint32_t HWCFGR3;                   /*!< MCE Version Register,                     Address offset: 0x3E8 */
  __IO uint32_t HWCFGR2;                   /*!< MCE Version Register,                     Address offset: 0x3EC */
  __IO uint32_t HWCFGR1;                   /*!< MCE Version Register,                     Address offset: 0x3F0 */
  __IO uint32_t VERR;                      /*!< MCE Version Register,                     Address offset: 0x3F4 */
  __IO uint32_t IPIDR;                     /*!< MCE Identification Register,              Address offset: 0x3F8 */
  __IO uint32_t SIDR;                      /*!< MCE Size ID Register,                     Address offset: 0x3FC */
} MCE_TypeDef;

/**
  * @brief USBPHYC  USB HS PHY Control
  */
typedef struct
{
  __IO uint32_t PLL;             /*!< USBPHYC PLL control register   Address offset: 0x000 */
       uint32_t RESERVED0;       /*!< Reserved                       Address offset: 0x004 */
  __IO uint32_t MISC;            /*!< USBPHYC misc control register  Address offset: 0x008 */
       uint32_t RESERVED1[64];   /*!< Reserved                       Address offset: 0x00C-0x108 */
  __IO uint32_t TUNE1;           /*!< USBPHYC PHY 1 TUNE register    Address offset: 0x10C */
       uint32_t RESERVED2[63];   /*!< Reserved                       Address offset: 0x110-0x208 */
  __IO uint32_t TUNE2;           /*!< USBPHYC PHY 2 TUNE register    Address offset: 0x20C */
       uint32_t RESERVED3[891];  /*!< Reserved                       Address offset: 0x210-0xFF8 */
  __IO uint32_t VERR;            /*!< USBPHYC VERSION register       Address offset: 0xFFC */
} USBPHYC_GlobalTypeDef;


/**
  * @brief TZC TrustZone Address Space Controller for DDR
  */
typedef struct
{
  __IO uint32_t BUILD_CONFIG;       /*!< Build config register,               Address offset: 0x00 */
  __IO uint32_t ACTION;             /*!< Action register,                     Address offset: 0x04 */
  __IO uint32_t GATE_KEEPER;        /*!< Gate keeper register,                Address offset: 0x08 */
  __IO uint32_t SPECULATION_CTRL;   /*!< Speculation control register,        Address offset: 0x0C */
  uint8_t RESERVED0[0x100 - 0x10];
  __IO uint32_t REG_BASE_LOWO;      /*!< Region 0 base address low register,  Address offset: 0x100 */
  __IO uint32_t REG_BASE_HIGHO;     /*!< Region 0 base address high register, Address offset: 0x104 */
  __IO uint32_t REG_TOP_LOWO;       /*!< Region 0 top address low register,   Address offset: 0x108 */
  __IO uint32_t REG_TOP_HIGHO;      /*!< Region 0 top address high register,  Address offset: 0x10C */
  __IO uint32_t REG_ATTRIBUTESO;    /*!< Region 0 attribute register,         Address offset: 0x110 */
  __IO uint32_t REG_ID_ACCESSO;     /*!< Region 0 ID access register,         Address offset: 0x114 */
} TZC_TypeDef;



/**
  * @brief ETZPC Extended TrustZone Protection Controller
  */
typedef struct
{
  __IO uint32_t   TZMA0_SIZE;         /*!<ETZPC ROM Secure Size Definition register,             Address offset: 0x00 */
  __IO uint32_t   TZMA1_SIZE;         /*!<ETZPC SYSRAM Secure Size Definition register,          Address offset: 0x04 */
  uint32_t        RESERVED0[2];       /*!< Reserved */
  __IO uint32_t   DECPROT0;           /*!<ETZPC Securable peripheral definition register 0,      Address offset: 0x10 */
  __IO uint32_t   DECPROT1;           /*!<ETZPC Securable peripheral definition register 1,      Address offset: 0x14 */
  __IO uint32_t   DECPROT2;           /*!<ETZPC Securable peripheral definition register 2,      Address offset: 0x18 */
  __IO uint32_t   DECPROT3;           /*!<ETZPC Securable peripheral definition register 3,      Address offset: 0x1C */
  __IO uint32_t   DECPROT4;           /*!<ETZPC Securable peripheral definition register 4,      Address offset: 0x20 */
  __IO uint32_t   DECPROT5;           /*!<ETZPC Securable peripheral definition register 5,      Address offset: 0x24 */
  uint32_t        RESERVED1[2];       /*!< Reserved */
  __IO uint32_t   DECPROT_LOCK0;      /*!<ETZPC Securable lock of security register 0,           Address offset: 0x30 */
  __IO uint32_t   DECPROT_LOCK1;      /*!<ETZPC Securable lock of security register 1,           Address offset: 0x34 */
  __IO uint32_t   DECPROT_LOCK2;      /*!<ETZPC Securable lock of security register 2,           Address offset: 0x38 */
  uint32_t        RESERVED2[237];     /*!< Reserved */
  __IO uint32_t   HWCFGR;             /*!< ETZPC IP HW configuration register                    Address offset:0x3F0  */
  __IO uint32_t   IP_VER;             /*!< ETZPC IP version register                             Address offset:0x3F4  */
  __IO uint32_t   ID;                 /*!< ETZPC IP version register                             Address offset:0x3F8  */
  __IO uint32_t   SID;                /*!< ETZPC IP version register                             Address offset:0x3FC  */
} ETZPC_TypeDef;



/**
  * @brief STGENC System Generic Counter Control
  */
typedef struct
{
  __IO uint32_t CNTCR;          /*!< STGENC Counter Control Register,              Address offset: 0x000 */
       uint32_t CNTSR;          /*!< STGENC Counter Status Register,               Address offset: 0x004 */
  __IO uint32_t CNTCVL;         /*!< STGENC Current Counter Value Lower Register,  Address offset: 0x008 */
  __IO uint32_t CNTCVU;         /*!< STGENC Current Counter Value Upper Register,  Address offset: 0x00C */
       uint32_t RESERVED1[4];                         /*!< Reserved, Address offsets: 0x010-0x01C */
  __IO uint32_t CNTFID0;        /*!< STGENC Base Frequency ID Register,            Address offset: 0x020 */
       uint32_t RESERVED2[1003];                      /*!< Reserved, Address offsets: 0x024-0xFCC */
  __IO uint32_t PIDR4;          /*!< STGENC Peripheral ID4 Register,               Address offset: 0xFD0 */
  __IO uint32_t RESERVED3[3];                         /*!< Reserved, Address offsets: 0xFD4-0xFDC */
  __IO uint32_t PIDR[4];        /*!< STGENC Peripheral ID0-ID3 Registers,          Address offset: 0xFE0 */
  __IO uint32_t CIDR[4];        /*!< STGENC Component ID0-ID3 Registers,           Address offset: 0xFF0 */
} STGENC_TypeDef;

/**
  * @brief STGENR System Timestamp Generator Read
  */
typedef struct
{
  __IO uint32_t CNTCVL;  /*!< STGENR Current Counter Value Lower Register,  Address offset: 0x000 */
  __IO uint32_t CNTCVU;  /*!< STGENR Current Counter Value Upper Register,  Address offset: 0x004 */
       uint32_t RESERVED1[1010];                      /*!< Reserved, Address offsets: 0x008-0xFCC */
  __IO uint32_t PIDR4;   /*!< STGENR Peripheral ID4 Register,               Address offset: 0xFD0 */
  __IO uint32_t RESERVED2[3];                         /*!< Reserved, Address offsets: 0xFD4-0xFDC */
  __IO uint32_t PIDR[4]; /*!< STGENR Peripheral ID0-ID3 Registers,          Address offset: 0xFE0 */
  __IO uint32_t CIDR[4]; /*!< STGENR Component ID0-ID3 Registers,           Address offset: 0xFF0 */
} STGENR_TypeDef;


/**
  * @brief Firewall
  */

typedef struct
{
  __IO uint32_t CSSA;     /*!< Code Segment Start Address register,              Address offset: 0x00 */
  __IO uint32_t CSL;      /*!< Code Segment Length register,                      Address offset: 0x04 */
  __IO uint32_t NVDSSA;   /*!< NON volatile data Segment Start Address register,  Address offset: 0x08 */
  __IO uint32_t NVDSL;    /*!< NON volatile data Segment Length register,         Address offset: 0x0C */
  __IO uint32_t VDSSA ;   /*!< Volatile data Segment Start Address register,      Address offset: 0x10 */
  __IO uint32_t VDSL ;    /*!< Volatile data Segment Length register,             Address offset: 0x14 */
  __IO uint32_t CR ;      /*!< Configuration  register,                           Address offset: 0x20 */

} FIREWALL_TypeDef;

/**
  * @brief Power Control
  */

typedef struct
{
  __IO uint32_t CR1;              /*!< PWR control register 1,                   Address offset: 0x00 */
  __IO uint32_t CSR1;             /*!< PWR control status register 1,            Address offset: 0x04 */
  __IO uint32_t CR2;              /*!< PWR control register 2,                   Address offset: 0x08 */
  __IO uint32_t CR3;              /*!< PWR control register 3,                   Address offset: 0x0C */
  __IO uint32_t MPUCR;            /*!< PWR MPU control register,                 Address offset: 0x10 */
       uint32_t RESERVED0[3];     /*!< Reserved, 0x14-0x1C                       Address offset: 0x14 */
  __IO uint32_t WKUPCR;           /*!< PWR wakeup clear register,                Address offset: 0x20 */
  __IO uint32_t WKUPFR;           /*!< PWR wakeup flag register,                 Address offset: 0x24 */
  __IO uint32_t MPUWKUPENR;       /*!< PWR wakeup enable and polarity register,  Address offset: 0x28 */
       uint32_t RESERVED1[242];   /*!< Reserved, 0x2C-0x3F0                      Address offset: 0x2C */
  __IO uint32_t VER;              /*!< PWR IP version register,                  Address offset: 0x3F4 */
  __IO uint32_t ID;               /*!< PWR IP identification register,           Address offset: 0x3F8 */
  __IO uint32_t SID;              /*!< PWR size ID register,                     Address offset: 0x3FC */
} PWR_TypeDef;


/**
  * @brief Reset and Clock Control
  */

