zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp131cxx_ca7.h
/*!< AHB5 */
#define BKPSRAM_BASE          (AHB5_PERIPH_BASE + 0x0000UL)
#define CRYP1_BASE            (AHB5_PERIPH_BASE + 0x2000UL)
#define HASH1_BASE            (AHB5_PERIPH_BASE + 0x3000UL)
#define HASH1_DIGEST_BASE     (AHB5_PERIPH_BASE + 0x3310UL)
#define RNG1_BASE             (AHB5_PERIPH_BASE + 0x4000UL)
#define SAES_BASE             (AHB5_PERIPH_BASE + 0x5000UL)
#define PKA_BASE              (AHB5_PERIPH_BASE + 0x6000UL)

/*!< GPV */

/*!< MPU_AHB6 */
#define MDMA_BASE               (AHB6_PERIPH_BASE + 0x0000UL)
#define MCE_BASE                (AHB6_PERIPH_BASE + 0x1000UL)
#define FMC_R_BASE              (AHB6_PERIPH_BASE + 0x2000UL)
#define QSPI_R_BASE             (AHB6_PERIPH_BASE + 0x3000UL)
#define DLYB_QSPI_BASE          (AHB6_PERIPH_BASE + 0x4000UL)
#define SDMMC1_BASE             (AHB6_PERIPH_BASE + 0x5000UL)
#define DLYB_SDMMC1_BASE        (AHB6_PERIPH_BASE + 0x6000UL)
#define SDMMC2_BASE             (AHB6_PERIPH_BASE + 0x7000UL)
#define DLYB_SDMMC2_BASE        (AHB6_PERIPH_BASE + 0x8000UL)
#define CRC1_BASE               (AHB6_PERIPH_BASE + 0x9000UL)
#define ETH_BASE                (AHB6_PERIPH_BASE + 0xA000UL)
#define ETH_MAC_BASE            (ETH_BASE)
#define USB1HSFSP2_BASE         (AHB6_PERIPH_BASE + 0xC000UL)
#define USB1HSFSP1_BASE         (AHB6_PERIPH_BASE + 0xD000UL)

/*!< MPU_APB4 */
#define IWDG2_BASE            (APB4_PERIPH_BASE + 0x2000UL)
#define DDRCTRL_BASE          (APB4_PERIPH_BASE + 0x3000UL)
#define DDRPHYC_BASE          (APB4_PERIPH_BASE + 0x4000UL)
#define STGENR_BASE           (APB4_PERIPH_BASE + 0x5000UL)
#define USBPHYC_BASE          (APB4_PERIPH_BASE + 0x6000UL)
#define DDRPERFM_BASE         (APB4_PERIPH_BASE + 0x7000UL)

/*!< MPU_APB5 */
#define IWDG1_BASE            (APB5_PERIPH_BASE + 0x3000UL)
#define RTC_BASE              (APB5_PERIPH_BASE + 0x4000UL)
#define BSEC_BASE             (APB5_PERIPH_BASE + 0x5000UL)
#define TZC_BASE              (APB5_PERIPH_BASE + 0x6000UL)
#define ETZPC_BASE            (APB5_PERIPH_BASE + 0x7000UL)
#define STGENC_BASE           (APB5_PERIPH_BASE + 0x8000UL)
#define TAMP_BASE             (APB5_PERIPH_BASE + 0xA000UL)



/*!< USB registers base address */
#define USB_OTG_GLOBAL_BASE                  ((uint32_t )0x000UL)
#define USB_OTG_DEVICE_BASE                  ((uint32_t )0x800UL)
#define USB_OTG_IN_ENDPOINT_BASE             ((uint32_t )0x900UL)
#define USB_OTG_OUT_ENDPOINT_BASE            ((uint32_t )0xB00UL)
#define USB_OTG_EP_REG_SIZE                  ((uint32_t )0x20UL)
#define USB_OTG_HOST_BASE                    ((uint32_t )0x400UL)
#define USB_OTG_HOST_PORT_BASE               ((uint32_t )0x440UL)
#define USB_OTG_HOST_CHANNEL_BASE            ((uint32_t )0x500UL)
#define USB_OTG_HOST_CHANNEL_SIZE            ((uint32_t )0x20UL)
#define USB_OTG_PCGCCTL_BASE                 ((uint32_t )0xE00UL)
#define USB_OTG_FIFO_BASE                    ((uint32_t )0x1000UL)
#define USB_OTG_FIFO_SIZE                    ((uint32_t )0x1000UL)



#define DMA1_Stream0_BASE     (DMA1_BASE + 0x010UL)
#define DMA1_Stream1_BASE     (DMA1_BASE + 0x028UL)
#define DMA1_Stream2_BASE     (DMA1_BASE + 0x040UL)
#define DMA1_Stream3_BASE     (DMA1_BASE + 0x058UL)
#define DMA1_Stream4_BASE     (DMA1_BASE + 0x070UL)
#define DMA1_Stream5_BASE     (DMA1_BASE + 0x088UL)
#define DMA1_Stream6_BASE     (DMA1_BASE + 0x0A0UL)
#define DMA1_Stream7_BASE     (DMA1_BASE + 0x0B8UL)

#define DMA2_Stream0_BASE     (DMA2_BASE + 0x010UL)
#define DMA2_Stream1_BASE     (DMA2_BASE + 0x028UL)
#define DMA2_Stream2_BASE     (DMA2_BASE + 0x040UL)
#define DMA2_Stream3_BASE     (DMA2_BASE + 0x058UL)
#define DMA2_Stream4_BASE     (DMA2_BASE + 0x070UL)
#define DMA2_Stream5_BASE     (DMA2_BASE + 0x088UL)
#define DMA2_Stream6_BASE     (DMA2_BASE + 0x0A0UL)
#define DMA2_Stream7_BASE     (DMA2_BASE + 0x0B8UL)

#define DMA3_Stream0_BASE     (DMA3_BASE + 0x010UL)
#define DMA3_Stream1_BASE     (DMA3_BASE + 0x028UL)
#define DMA3_Stream2_BASE     (DMA3_BASE + 0x040UL)
#define DMA3_Stream3_BASE     (DMA3_BASE + 0x058UL)
#define DMA3_Stream4_BASE     (DMA3_BASE + 0x070UL)
#define DMA3_Stream5_BASE     (DMA3_BASE + 0x088UL)
#define DMA3_Stream6_BASE     (DMA3_BASE + 0x0A0UL)
#define DMA3_Stream7_BASE     (DMA3_BASE + 0x0B8UL)

#define DMAMUX1_Channel0_BASE    (DMAMUX1_BASE)
#define DMAMUX1_Channel1_BASE    (DMAMUX1_BASE + 0x0004UL)
#define DMAMUX1_Channel2_BASE    (DMAMUX1_BASE + 0x0008UL)
#define DMAMUX1_Channel3_BASE    (DMAMUX1_BASE + 0x000CUL)
#define DMAMUX1_Channel4_BASE    (DMAMUX1_BASE + 0x0010UL)
#define DMAMUX1_Channel5_BASE    (DMAMUX1_BASE + 0x0014UL)
#define DMAMUX1_Channel6_BASE    (DMAMUX1_BASE + 0x0018UL)
#define DMAMUX1_Channel7_BASE    (DMAMUX1_BASE + 0x001CUL)
#define DMAMUX1_Channel8_BASE    (DMAMUX1_BASE + 0x0020UL)
#define DMAMUX1_Channel9_BASE    (DMAMUX1_BASE + 0x0024UL)
#define DMAMUX1_Channel10_BASE   (DMAMUX1_BASE + 0x0028UL)
#define DMAMUX1_Channel11_BASE   (DMAMUX1_BASE + 0x002CUL)
#define DMAMUX1_Channel12_BASE   (DMAMUX1_BASE + 0x0030UL)
#define DMAMUX1_Channel13_BASE   (DMAMUX1_BASE + 0x0034UL)
#define DMAMUX1_Channel14_BASE   (DMAMUX1_BASE + 0x0038UL)
#define DMAMUX1_Channel15_BASE   (DMAMUX1_BASE + 0x003CUL)

#define DMAMUX1_RequestGenerator0_BASE  (DMAMUX1_BASE + 0x0100UL)
#define DMAMUX1_RequestGenerator1_BASE  (DMAMUX1_BASE + 0x0104UL)
#define DMAMUX1_RequestGenerator2_BASE  (DMAMUX1_BASE + 0x0108UL)
#define DMAMUX1_RequestGenerator3_BASE  (DMAMUX1_BASE + 0x010CUL)

#define DMAMUX1_ChannelStatus_BASE      (DMAMUX1_BASE + 0x0080UL)
#define DMAMUX1_RequestGenStatus_BASE   (DMAMUX1_BASE + 0x0140UL)

#define DMAMUX2_Channel0_BASE    (DMAMUX2_BASE)
#define DMAMUX2_Channel1_BASE    (DMAMUX2_BASE + 0x0004UL)
#define DMAMUX2_Channel2_BASE    (DMAMUX2_BASE + 0x0008UL)
#define DMAMUX2_Channel3_BASE    (DMAMUX2_BASE + 0x000CUL)
#define DMAMUX2_Channel4_BASE    (DMAMUX2_BASE + 0x0010UL)
#define DMAMUX2_Channel5_BASE    (DMAMUX2_BASE + 0x0014UL)
#define DMAMUX2_Channel6_BASE    (DMAMUX2_BASE + 0x0018UL)
#define DMAMUX2_Channel7_BASE    (DMAMUX2_BASE + 0x001CUL)

#define DMAMUX2_RequestGenerator0_BASE  (DMAMUX2_BASE + 0x0100UL)
#define DMAMUX2_RequestGenerator1_BASE  (DMAMUX2_BASE + 0x0104UL)
#define DMAMUX2_RequestGenerator2_BASE  (DMAMUX2_BASE + 0x0108UL)
#define DMAMUX2_RequestGenerator3_BASE  (DMAMUX2_BASE + 0x010CUL)

#define DMAMUX2_ChannelStatus_BASE      (DMAMUX2_BASE + 0x0080UL)
#define DMAMUX2_RequestGenStatus_BASE   (DMAMUX2_BASE + 0x0140UL)

/*!< FMC Banks registers base  address */
#define FMC_Bank1_R_BASE      (FMC_R_BASE + 0x0000UL)
#define FMC_Bank1E_R_BASE     (FMC_R_BASE + 0x0104UL)
#define FMC_Bank2_R_BASE      (FMC_R_BASE + 0x0060UL)
#define FMC_Bank3_R_BASE      (FMC_R_BASE + 0x0080UL)
#define FMC_Bank5_6_R_BASE    (FMC_R_BASE + 0x0140UL)

#define MDMA_NB_CHANNELS        32
#define MDMA_Channel0_BASE    (MDMA_BASE + 0x00000040UL)
#define MDMA_Channel1_BASE    (MDMA_BASE + 0x00000080UL)
#define MDMA_Channel2_BASE    (MDMA_BASE + 0x000000C0UL)
#define MDMA_Channel3_BASE    (MDMA_BASE + 0x00000100UL)
#define MDMA_Channel4_BASE    (MDMA_BASE + 0x00000140UL)
#define MDMA_Channel5_BASE    (MDMA_BASE + 0x00000180UL)
#define MDMA_Channel6_BASE    (MDMA_BASE + 0x000001C0UL)
#define MDMA_Channel7_BASE    (MDMA_BASE + 0x00000200UL)
#define MDMA_Channel8_BASE    (MDMA_BASE + 0x00000240UL)
#define MDMA_Channel9_BASE    (MDMA_BASE + 0x00000280UL)
#define MDMA_Channel10_BASE   (MDMA_BASE + 0x000002C0UL)
#define MDMA_Channel11_BASE   (MDMA_BASE + 0x00000300UL)
#define MDMA_Channel12_BASE   (MDMA_BASE + 0x00000340UL)
#define MDMA_Channel13_BASE   (MDMA_BASE + 0x00000380UL)
#define MDMA_Channel14_BASE   (MDMA_BASE + 0x000003C0UL)
#define MDMA_Channel15_BASE   (MDMA_BASE + 0x00000400UL)
#define MDMA_Channel16_BASE   (MDMA_BASE + 0x00000440UL)
#define MDMA_Channel17_BASE   (MDMA_BASE + 0x00000480UL)
#define MDMA_Channel18_BASE   (MDMA_BASE + 0x000004C0UL)
#define MDMA_Channel19_BASE   (MDMA_BASE + 0x00000500UL)
#define MDMA_Channel20_BASE   (MDMA_BASE + 0x00000540UL)
#define MDMA_Channel21_BASE   (MDMA_BASE + 0x00000580UL)
#define MDMA_Channel22_BASE   (MDMA_BASE + 0x000005C0UL)
#define MDMA_Channel23_BASE   (MDMA_BASE + 0x00000600UL)
#define MDMA_Channel24_BASE   (MDMA_BASE + 0x00000640UL)
#define MDMA_Channel25_BASE   (MDMA_BASE + 0x00000680UL)
#define MDMA_Channel26_BASE   (MDMA_BASE + 0x000006C0UL)
#define MDMA_Channel27_BASE   (MDMA_BASE + 0x00000700UL)
#define MDMA_Channel28_BASE   (MDMA_BASE + 0x00000740UL)
#define MDMA_Channel29_BASE   (MDMA_BASE + 0x00000780UL)
#define MDMA_Channel30_BASE   (MDMA_BASE + 0x000007C0UL)
#define MDMA_Channel31_BASE   (MDMA_BASE + 0x00000800UL)

/**
  * @}
  */

/** @addtogroup Peripheral_declaration
  * @{
  */
#define TIM2                ((TIM_TypeDef *) TIM2_BASE)
#define TIM3                ((TIM_TypeDef *) TIM3_BASE)
#define TIM4                ((TIM_TypeDef *) TIM4_BASE)
#define TIM5                ((TIM_TypeDef *) TIM5_BASE)
#define TIM6                ((TIM_TypeDef *) TIM6_BASE)
#define TIM7                ((TIM_TypeDef *) TIM7_BASE)
#define TIM12               ((TIM_TypeDef *) TIM12_BASE)
#define TIM13               ((TIM_TypeDef *) TIM13_BASE)
#define TIM14               ((TIM_TypeDef *) TIM14_BASE)
#define LCD                 ((LCD_TypeDef *) LCD_BASE)
#define RTC                 ((RTC_TypeDef *) RTC_BASE)
#define TAMP                 ((TAMP_TypeDef *) TAMP_BASE)
#define IWDG1               ((IWDG_TypeDef *) IWDG1_BASE)
#define IWDG2               ((IWDG_TypeDef *) IWDG2_BASE)
#define SPI2                ((SPI_TypeDef *) SPI2_BASE)
#define SPI3                ((SPI_TypeDef *) SPI3_BASE)
#define SPI4                ((SPI_TypeDef *) SPI4_BASE)
#define SPI5                ((SPI_TypeDef *) SPI5_BASE)
#define USART2              ((USART_TypeDef *) USART2_BASE)
#define USART3              ((USART_TypeDef *) USART3_BASE)
#define USART6              ((USART_TypeDef *) USART6_BASE)
#define UART7               ((USART_TypeDef *) UART7_BASE)
#define UART8               ((USART_TypeDef *) UART8_BASE)
#define UART4               ((USART_TypeDef *) UART4_BASE)
#define UART5               ((USART_TypeDef *) UART5_BASE)
#define I2C1                ((I2C_TypeDef *) I2C1_BASE)
#define I2C2                ((I2C_TypeDef *) I2C2_BASE)
#define I2C3                ((I2C_TypeDef *) I2C3_BASE)
#define I2C4                ((I2C_TypeDef *) I2C4_BASE)
#define I2C5                ((I2C_TypeDef *) I2C5_BASE)
#define LPTIM1              ((LPTIM_TypeDef *) LPTIM1_BASE)
#define PWR                 ((PWR_TypeDef *) PWR_BASE)
#define LPTIM2              ((LPTIM_TypeDef *) LPTIM2_BASE)
#define LPTIM3              ((LPTIM_TypeDef *) LPTIM3_BASE)
#define LPTIM4              ((LPTIM_TypeDef *) LPTIM4_BASE)
#define LPTIM5              ((LPTIM_TypeDef *) LPTIM5_BASE)
#define SYSCFG              ((SYSCFG_TypeDef *) SYSCFG_BASE)
#define VREFBUF             ((VREF_TypeDef *) VREFBUF_BASE)



#define EXTI                ((EXTI_TypeDef *) EXTI_BASE)
#define EXTI_C1             ((EXTI_Core_TypeDef *) EXTI_C1_BASE)
#define TIM1                ((TIM_TypeDef *) TIM1_BASE)
#define SPI1                ((SPI_TypeDef *) SPI1_BASE)
#define TIM8                ((TIM_TypeDef *) TIM8_BASE)
#define USART1              ((USART_TypeDef *) USART1_BASE)
#define TIM15               ((TIM_TypeDef *) TIM15_BASE)
#define TIM16               ((TIM_TypeDef *) TIM16_BASE)
#define TIM17               ((TIM_TypeDef *) TIM17_BASE)
#define SAI1                ((SAI_TypeDef *) SAI1_BASE)
#define SAI1_Block_A        ((SAI_Block_TypeDef *)SAI1_Block_A_BASE)
#define SAI1_Block_B        ((SAI_Block_TypeDef *)SAI1_Block_B_BASE)
#define SAI2                ((SAI_TypeDef *) SAI2_BASE)
#define SAI2_Block_A        ((SAI_Block_TypeDef *)SAI2_Block_A_BASE)
#define SAI2_Block_B        ((SAI_Block_TypeDef *)SAI2_Block_B_BASE)
#define DTS1                ((DTS_TypeDef *) DTS_BASE)
#define PMB                 ((PMB_TypeDef *) PMB_BASE)
#define SPDIFRX             ((SPDIFRX_TypeDef *) SPDIFRX_BASE)
#define DFSDM1              ((DFSDM_TypeDef *) DFSDM1_BASE)
#define DFSDM1_Channel0     ((DFSDM_Channel_TypeDef *) DFSDM1_Channel0_BASE)
#define DFSDM1_Channel1     ((DFSDM_Channel_TypeDef *) DFSDM1_Channel1_BASE)
#define DFSDM1_Channel2     ((DFSDM_Channel_TypeDef *) DFSDM1_Channel2_BASE)
#define DFSDM1_Channel3     ((DFSDM_Channel_TypeDef *) DFSDM1_Channel3_BASE)
#define DFSDM1_Filter0      ((DFSDM_Filter_TypeDef *) DFSDM1_Filter0_BASE)
#define DFSDM1_Filter1      ((DFSDM_Filter_TypeDef *) DFSDM1_Filter1_BASE)

#define RCC                 ((RCC_TypeDef *) RCC_BASE)

