zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp131cxx_ca7.h
/***************  Bit definition for RCC_APB1RSTCLRR register  ****************/
#define RCC_APB1RSTCLRR_TIM2RST_Pos                (0U)
#define RCC_APB1RSTCLRR_TIM2RST_Msk                (0x1UL << RCC_APB1RSTCLRR_TIM2RST_Pos)               /*!< 0x00000001 */
#define RCC_APB1RSTCLRR_TIM2RST                    RCC_APB1RSTCLRR_TIM2RST_Msk                         /*!< TIM2 block reset Cleared by software. */
#define RCC_APB1RSTCLRR_TIM3RST_Pos                (1U)
#define RCC_APB1RSTCLRR_TIM3RST_Msk                (0x1UL << RCC_APB1RSTCLRR_TIM3RST_Pos)               /*!< 0x00000002 */
#define RCC_APB1RSTCLRR_TIM3RST                    RCC_APB1RSTCLRR_TIM3RST_Msk                         /*!< TIM3 block reset Cleared by software. */
#define RCC_APB1RSTCLRR_TIM4RST_Pos                (2U)
#define RCC_APB1RSTCLRR_TIM4RST_Msk                (0x1UL << RCC_APB1RSTCLRR_TIM4RST_Pos)               /*!< 0x00000004 */
#define RCC_APB1RSTCLRR_TIM4RST                    RCC_APB1RSTCLRR_TIM4RST_Msk                         /*!< TIM4 block reset Cleared by software. */
#define RCC_APB1RSTCLRR_TIM5RST_Pos                (3U)
#define RCC_APB1RSTCLRR_TIM5RST_Msk                (0x1UL << RCC_APB1RSTCLRR_TIM5RST_Pos)               /*!< 0x00000008 */
#define RCC_APB1RSTCLRR_TIM5RST                    RCC_APB1RSTCLRR_TIM5RST_Msk                         /*!< TIM5 block reset Cleared by software. */
#define RCC_APB1RSTCLRR_TIM6RST_Pos                (4U)
#define RCC_APB1RSTCLRR_TIM6RST_Msk                (0x1UL << RCC_APB1RSTCLRR_TIM6RST_Pos)               /*!< 0x00000010 */
#define RCC_APB1RSTCLRR_TIM6RST                    RCC_APB1RSTCLRR_TIM6RST_Msk                         /*!< TIM6 block reset Cleared by software. */
#define RCC_APB1RSTCLRR_TIM7RST_Pos                (5U)
#define RCC_APB1RSTCLRR_TIM7RST_Msk                (0x1UL << RCC_APB1RSTCLRR_TIM7RST_Pos)               /*!< 0x00000020 */
#define RCC_APB1RSTCLRR_TIM7RST                    RCC_APB1RSTCLRR_TIM7RST_Msk                         /*!< TIM7 block reset Cleared by software. */
#define RCC_APB1RSTCLRR_LPTIM1RST_Pos              (9U)
#define RCC_APB1RSTCLRR_LPTIM1RST_Msk              (0x1UL << RCC_APB1RSTCLRR_LPTIM1RST_Pos)             /*!< 0x00000200 */
#define RCC_APB1RSTCLRR_LPTIM1RST                  RCC_APB1RSTCLRR_LPTIM1RST_Msk                       /*!< LPTIM1 block reset Cleared by software. */
#define RCC_APB1RSTCLRR_SPI2RST_Pos                (11U)
#define RCC_APB1RSTCLRR_SPI2RST_Msk                (0x1UL << RCC_APB1RSTCLRR_SPI2RST_Pos)               /*!< 0x00000800 */
#define RCC_APB1RSTCLRR_SPI2RST                    RCC_APB1RSTCLRR_SPI2RST_Msk                         /*!< SPI2 block reset Cleared by software. */
#define RCC_APB1RSTCLRR_SPI3RST_Pos                (12U)
#define RCC_APB1RSTCLRR_SPI3RST_Msk                (0x1UL << RCC_APB1RSTCLRR_SPI3RST_Pos)               /*!< 0x00001000 */
#define RCC_APB1RSTCLRR_SPI3RST                    RCC_APB1RSTCLRR_SPI3RST_Msk                         /*!< SPI3 block reset Cleared by software. */
#define RCC_APB1RSTCLRR_USART3RST_Pos              (15U)
#define RCC_APB1RSTCLRR_USART3RST_Msk              (0x1UL << RCC_APB1RSTCLRR_USART3RST_Pos)             /*!< 0x00008000 */
#define RCC_APB1RSTCLRR_USART3RST                  RCC_APB1RSTCLRR_USART3RST_Msk                       /*!< USART3 block reset Cleared by software. */
#define RCC_APB1RSTCLRR_UART4RST_Pos               (16U)
#define RCC_APB1RSTCLRR_UART4RST_Msk               (0x1UL << RCC_APB1RSTCLRR_UART4RST_Pos)              /*!< 0x00010000 */
#define RCC_APB1RSTCLRR_UART4RST                   RCC_APB1RSTCLRR_UART4RST_Msk                        /*!< UART4 block reset Cleared by software. */
#define RCC_APB1RSTCLRR_UART5RST_Pos               (17U)
#define RCC_APB1RSTCLRR_UART5RST_Msk               (0x1UL << RCC_APB1RSTCLRR_UART5RST_Pos)              /*!< 0x00020000 */
#define RCC_APB1RSTCLRR_UART5RST                   RCC_APB1RSTCLRR_UART5RST_Msk                        /*!< UART5 block reset Cleared by software. */
#define RCC_APB1RSTCLRR_UART7RST_Pos               (18U)
#define RCC_APB1RSTCLRR_UART7RST_Msk               (0x1UL << RCC_APB1RSTCLRR_UART7RST_Pos)              /*!< 0x00040000 */
#define RCC_APB1RSTCLRR_UART7RST                   RCC_APB1RSTCLRR_UART7RST_Msk                        /*!< UART7 block reset Cleared by software. */
#define RCC_APB1RSTCLRR_UART8RST_Pos               (19U)
#define RCC_APB1RSTCLRR_UART8RST_Msk               (0x1UL << RCC_APB1RSTCLRR_UART8RST_Pos)              /*!< 0x00080000 */
#define RCC_APB1RSTCLRR_UART8RST                   RCC_APB1RSTCLRR_UART8RST_Msk                        /*!< UART8 block reset Cleared by software. */
#define RCC_APB1RSTCLRR_I2C1RST_Pos                (21U)
#define RCC_APB1RSTCLRR_I2C1RST_Msk                (0x1UL << RCC_APB1RSTCLRR_I2C1RST_Pos)               /*!< 0x00200000 */
#define RCC_APB1RSTCLRR_I2C1RST                    RCC_APB1RSTCLRR_I2C1RST_Msk                         /*!< I2C1 block reset Cleared by software. */
#define RCC_APB1RSTCLRR_I2C2RST_Pos                (22U)
#define RCC_APB1RSTCLRR_I2C2RST_Msk                (0x1UL << RCC_APB1RSTCLRR_I2C2RST_Pos)               /*!< 0x00400000 */
#define RCC_APB1RSTCLRR_I2C2RST                    RCC_APB1RSTCLRR_I2C2RST_Msk                         /*!< I2C2 block reset Cleared by software. */
#define RCC_APB1RSTCLRR_SPDIFRST_Pos               (26U)
#define RCC_APB1RSTCLRR_SPDIFRST_Msk               (0x1UL << RCC_APB1RSTCLRR_SPDIFRST_Pos)              /*!< 0x04000000 */
#define RCC_APB1RSTCLRR_SPDIFRST                   RCC_APB1RSTCLRR_SPDIFRST_Msk                        /*!< SPDIFRX block reset Cleared by software. */

/***************  Bit definition for RCC_APB2RSTSETR register  ****************/
#define RCC_APB2RSTSETR_TIM1RST_Pos                (0U)
#define RCC_APB2RSTSETR_TIM1RST_Msk                (0x1UL << RCC_APB2RSTSETR_TIM1RST_Pos)               /*!< 0x00000001 */
#define RCC_APB2RSTSETR_TIM1RST                    RCC_APB2RSTSETR_TIM1RST_Msk                         /*!< TIM1 block reset Set by software. */
#define RCC_APB2RSTSETR_TIM8RST_Pos                (1U)
#define RCC_APB2RSTSETR_TIM8RST_Msk                (0x1UL << RCC_APB2RSTSETR_TIM8RST_Pos)               /*!< 0x00000002 */
#define RCC_APB2RSTSETR_TIM8RST                    RCC_APB2RSTSETR_TIM8RST_Msk                         /*!< TIM8 block reset Set by software. */
#define RCC_APB2RSTSETR_SPI1RST_Pos                (8U)
#define RCC_APB2RSTSETR_SPI1RST_Msk                (0x1UL << RCC_APB2RSTSETR_SPI1RST_Pos)               /*!< 0x00000100 */
#define RCC_APB2RSTSETR_SPI1RST                    RCC_APB2RSTSETR_SPI1RST_Msk                         /*!< SPI/I2S1 block reset Set by software. */
#define RCC_APB2RSTSETR_USART6RST_Pos              (13U)
#define RCC_APB2RSTSETR_USART6RST_Msk              (0x1UL << RCC_APB2RSTSETR_USART6RST_Pos)             /*!< 0x00002000 */
#define RCC_APB2RSTSETR_USART6RST                  RCC_APB2RSTSETR_USART6RST_Msk                       /*!< USART6 block reset Set by software. */
#define RCC_APB2RSTSETR_SAI1RST_Pos                (16U)
#define RCC_APB2RSTSETR_SAI1RST_Msk                (0x1UL << RCC_APB2RSTSETR_SAI1RST_Pos)               /*!< 0x00010000 */
#define RCC_APB2RSTSETR_SAI1RST                    RCC_APB2RSTSETR_SAI1RST_Msk                         /*!< SAI1 block reset Set by software. */
#define RCC_APB2RSTSETR_SAI2RST_Pos                (17U)
#define RCC_APB2RSTSETR_SAI2RST_Msk                (0x1UL << RCC_APB2RSTSETR_SAI2RST_Pos)               /*!< 0x00020000 */
#define RCC_APB2RSTSETR_SAI2RST                    RCC_APB2RSTSETR_SAI2RST_Msk                         /*!< SAI2 block reset Set by software. */
#define RCC_APB2RSTSETR_DFSDMRST_Pos               (20U)
#define RCC_APB2RSTSETR_DFSDMRST_Msk               (0x1UL << RCC_APB2RSTSETR_DFSDMRST_Pos)              /*!< 0x00100000 */
#define RCC_APB2RSTSETR_DFSDMRST                   RCC_APB2RSTSETR_DFSDMRST_Msk                        /*!< DFSDM block reset Set by software. */
#define RCC_APB2RSTSETR_FDCANRST_Pos               (24U)
#define RCC_APB2RSTSETR_FDCANRST_Msk               (0x1UL << RCC_APB2RSTSETR_FDCANRST_Pos)              /*!< 0x01000000 */
#define RCC_APB2RSTSETR_FDCANRST                   RCC_APB2RSTSETR_FDCANRST_Msk                        /*!< FDCAN block reset Set by software. */

/***************  Bit definition for RCC_APB2RSTCLRR register  ****************/
#define RCC_APB2RSTCLRR_TIM1RST_Pos                (0U)
#define RCC_APB2RSTCLRR_TIM1RST_Msk                (0x1UL << RCC_APB2RSTCLRR_TIM1RST_Pos)               /*!< 0x00000001 */
#define RCC_APB2RSTCLRR_TIM1RST                    RCC_APB2RSTCLRR_TIM1RST_Msk                         /*!< TIM1 block reset Cleared by software. */
#define RCC_APB2RSTCLRR_TIM8RST_Pos                (1U)
#define RCC_APB2RSTCLRR_TIM8RST_Msk                (0x1UL << RCC_APB2RSTCLRR_TIM8RST_Pos)               /*!< 0x00000002 */
#define RCC_APB2RSTCLRR_TIM8RST                    RCC_APB2RSTCLRR_TIM8RST_Msk                         /*!< TIM8 block reset Cleared by software. */
#define RCC_APB2RSTCLRR_SPI1RST_Pos                (8U)
#define RCC_APB2RSTCLRR_SPI1RST_Msk                (0x1UL << RCC_APB2RSTCLRR_SPI1RST_Pos)               /*!< 0x00000100 */
#define RCC_APB2RSTCLRR_SPI1RST                    RCC_APB2RSTCLRR_SPI1RST_Msk                         /*!< SPI/I2S1 block reset Cleared by software. */
#define RCC_APB2RSTCLRR_USART6RST_Pos              (13U)
#define RCC_APB2RSTCLRR_USART6RST_Msk              (0x1UL << RCC_APB2RSTCLRR_USART6RST_Pos)             /*!< 0x00002000 */
#define RCC_APB2RSTCLRR_USART6RST                  RCC_APB2RSTCLRR_USART6RST_Msk                       /*!< USART6 block reset Cleared by software. */
#define RCC_APB2RSTCLRR_SAI1RST_Pos                (16U)
#define RCC_APB2RSTCLRR_SAI1RST_Msk                (0x1UL << RCC_APB2RSTCLRR_SAI1RST_Pos)               /*!< 0x00010000 */
#define RCC_APB2RSTCLRR_SAI1RST                    RCC_APB2RSTCLRR_SAI1RST_Msk                         /*!< SAI1 block reset Cleared by software. */
#define RCC_APB2RSTCLRR_SAI2RST_Pos                (17U)
#define RCC_APB2RSTCLRR_SAI2RST_Msk                (0x1UL << RCC_APB2RSTCLRR_SAI2RST_Pos)               /*!< 0x00020000 */
#define RCC_APB2RSTCLRR_SAI2RST                    RCC_APB2RSTCLRR_SAI2RST_Msk                         /*!< SAI2 block reset Cleared by software. */
#define RCC_APB2RSTCLRR_DFSDMRST_Pos               (20U)
#define RCC_APB2RSTCLRR_DFSDMRST_Msk               (0x1UL << RCC_APB2RSTCLRR_DFSDMRST_Pos)              /*!< 0x00100000 */
#define RCC_APB2RSTCLRR_DFSDMRST                   RCC_APB2RSTCLRR_DFSDMRST_Msk                        /*!< DFSDM block reset Cleared by software. */
#define RCC_APB2RSTCLRR_FDCANRST_Pos               (24U)
#define RCC_APB2RSTCLRR_FDCANRST_Msk               (0x1UL << RCC_APB2RSTCLRR_FDCANRST_Pos)              /*!< 0x01000000 */
#define RCC_APB2RSTCLRR_FDCANRST                   RCC_APB2RSTCLRR_FDCANRST_Msk                        /*!< FDCAN block reset Cleared by software. */

/***************  Bit definition for RCC_APB3RSTSETR register  ****************/
#define RCC_APB3RSTSETR_LPTIM2RST_Pos              (0U)
#define RCC_APB3RSTSETR_LPTIM2RST_Msk              (0x1UL << RCC_APB3RSTSETR_LPTIM2RST_Pos)             /*!< 0x00000001 */
#define RCC_APB3RSTSETR_LPTIM2RST                  RCC_APB3RSTSETR_LPTIM2RST_Msk                       /*!< LPTIM2 block reset Set by software. If LPTIM3 block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. */
#define RCC_APB3RSTSETR_LPTIM3RST_Pos              (1U)
#define RCC_APB3RSTSETR_LPTIM3RST_Msk              (0x1UL << RCC_APB3RSTSETR_LPTIM3RST_Pos)             /*!< 0x00000002 */
#define RCC_APB3RSTSETR_LPTIM3RST                  RCC_APB3RSTSETR_LPTIM3RST_Msk                       /*!< LPTIM3 block reset Set by software. If LPTIM3 block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. */
#define RCC_APB3RSTSETR_LPTIM4RST_Pos              (2U)
#define RCC_APB3RSTSETR_LPTIM4RST_Msk              (0x1UL << RCC_APB3RSTSETR_LPTIM4RST_Pos)             /*!< 0x00000004 */
#define RCC_APB3RSTSETR_LPTIM4RST                  RCC_APB3RSTSETR_LPTIM4RST_Msk                       /*!< LPTIM4 block reset Set by software. */
#define RCC_APB3RSTSETR_LPTIM5RST_Pos              (3U)
#define RCC_APB3RSTSETR_LPTIM5RST_Msk              (0x1UL << RCC_APB3RSTSETR_LPTIM5RST_Pos)             /*!< 0x00000008 */
#define RCC_APB3RSTSETR_LPTIM5RST                  RCC_APB3RSTSETR_LPTIM5RST_Msk                       /*!< LPTIM5 block reset Set by software. */
#define RCC_APB3RSTSETR_SYSCFGRST_Pos              (11U)
#define RCC_APB3RSTSETR_SYSCFGRST_Msk              (0x1UL << RCC_APB3RSTSETR_SYSCFGRST_Pos)             /*!< 0x00000800 */
#define RCC_APB3RSTSETR_SYSCFGRST                  RCC_APB3RSTSETR_SYSCFGRST_Msk                       /*!< SYSCFG block reset A write access to this register field must be secure. A read access may be secure or non-secure. Set by (secure) software. */
#define RCC_APB3RSTSETR_VREFRST_Pos                (13U)
#define RCC_APB3RSTSETR_VREFRST_Msk                (0x1UL << RCC_APB3RSTSETR_VREFRST_Pos)               /*!< 0x00002000 */
#define RCC_APB3RSTSETR_VREFRST                    RCC_APB3RSTSETR_VREFRST_Msk                         /*!< VREF block reset If VREF block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_APB3RSTSETR_DTSRST_Pos                 (16U)
#define RCC_APB3RSTSETR_DTSRST_Msk                 (0x1UL << RCC_APB3RSTSETR_DTSRST_Pos)                /*!< 0x00010000 */
#define RCC_APB3RSTSETR_DTSRST                     RCC_APB3RSTSETR_DTSRST_Msk                          /*!< DTS block reset Set by software. */
#define RCC_APB3RSTSETR_PMBCTRLRST_Pos             (17U)
#define RCC_APB3RSTSETR_PMBCTRLRST_Msk             (0x1UL << RCC_APB3RSTSETR_PMBCTRLRST_Pos)            /*!< 0x00020000 */
#define RCC_APB3RSTSETR_PMBCTRLRST                 RCC_APB3RSTSETR_PMBCTRLRST_Msk                      /*!< PMBCTRL block reset (non-user): this bit is present in the RTL and is internally used as: SPIRIT parameter RTLPRESENT */

/***************  Bit definition for RCC_APB3RSTCLRR register  ****************/
#define RCC_APB3RSTCLRR_LPTIM2RST_Pos              (0U)
#define RCC_APB3RSTCLRR_LPTIM2RST_Msk              (0x1UL << RCC_APB3RSTCLRR_LPTIM2RST_Pos)             /*!< 0x00000001 */
#define RCC_APB3RSTCLRR_LPTIM2RST                  RCC_APB3RSTCLRR_LPTIM2RST_Msk                       /*!< LPTIM2 block reset If LPTIM2 block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_APB3RSTCLRR_LPTIM3RST_Pos              (1U)
#define RCC_APB3RSTCLRR_LPTIM3RST_Msk              (0x1UL << RCC_APB3RSTCLRR_LPTIM3RST_Pos)             /*!< 0x00000002 */
#define RCC_APB3RSTCLRR_LPTIM3RST                  RCC_APB3RSTCLRR_LPTIM3RST_Msk                       /*!< LPTIM3 block reset If LPTIM3 block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_APB3RSTCLRR_LPTIM4RST_Pos              (2U)
#define RCC_APB3RSTCLRR_LPTIM4RST_Msk              (0x1UL << RCC_APB3RSTCLRR_LPTIM4RST_Pos)             /*!< 0x00000004 */
#define RCC_APB3RSTCLRR_LPTIM4RST                  RCC_APB3RSTCLRR_LPTIM4RST_Msk                       /*!< LPTIM4 block reset Cleared by software. */
#define RCC_APB3RSTCLRR_LPTIM5RST_Pos              (3U)
#define RCC_APB3RSTCLRR_LPTIM5RST_Msk              (0x1UL << RCC_APB3RSTCLRR_LPTIM5RST_Pos)             /*!< 0x00000008 */
#define RCC_APB3RSTCLRR_LPTIM5RST                  RCC_APB3RSTCLRR_LPTIM5RST_Msk                       /*!< LPTIM5 block reset Cleared by software. */
#define RCC_APB3RSTCLRR_SYSCFGRST_Pos              (11U)
#define RCC_APB3RSTCLRR_SYSCFGRST_Msk              (0x1UL << RCC_APB3RSTCLRR_SYSCFGRST_Pos)             /*!< 0x00000800 */
#define RCC_APB3RSTCLRR_SYSCFGRST                  RCC_APB3RSTCLRR_SYSCFGRST_Msk                       /*!< SYSCFG block reset A write access to this register field must be secure. A read access may be secure or non-secure. Cleared by (secure) software. */
#define RCC_APB3RSTCLRR_VREFRST_Pos                (13U)
#define RCC_APB3RSTCLRR_VREFRST_Msk                (0x1UL << RCC_APB3RSTCLRR_VREFRST_Pos)               /*!< 0x00002000 */
#define RCC_APB3RSTCLRR_VREFRST                    RCC_APB3RSTCLRR_VREFRST_Msk                         /*!< VREF block reset If VREF block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_APB3RSTCLRR_DTSRST_Pos                 (16U)
#define RCC_APB3RSTCLRR_DTSRST_Msk                 (0x1UL << RCC_APB3RSTCLRR_DTSRST_Pos)                /*!< 0x00010000 */
#define RCC_APB3RSTCLRR_DTSRST                     RCC_APB3RSTCLRR_DTSRST_Msk                          /*!< DTS block reset Cleared by software. */
#define RCC_APB3RSTCLRR_PMBCTRLRST_Pos             (17U)
#define RCC_APB3RSTCLRR_PMBCTRLRST_Msk             (0x1UL << RCC_APB3RSTCLRR_PMBCTRLRST_Pos)            /*!< 0x00020000 */
#define RCC_APB3RSTCLRR_PMBCTRLRST                 RCC_APB3RSTCLRR_PMBCTRLRST_Msk                      /*!< PMBCTRL block reset (non-user): this bit is present in the RTL and is internally used as: SPIRIT parameter RTLPRESENT */

/***************  Bit definition for RCC_APB4RSTSETR register  ****************/
#define RCC_APB4RSTSETR_LTDCRST_Pos                (0U)
#define RCC_APB4RSTSETR_LTDCRST_Msk                (0x1UL << RCC_APB4RSTSETR_LTDCRST_Pos)               /*!< 0x00000001 */
#define RCC_APB4RSTSETR_LTDCRST                    RCC_APB4RSTSETR_LTDCRST_Msk                         /*!< LTDC block reset If LTDC is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_APB4RSTSETR_DCMIPPRST_Pos              (1U)
#define RCC_APB4RSTSETR_DCMIPPRST_Msk              (0x1UL << RCC_APB4RSTSETR_DCMIPPRST_Pos)             /*!< 0x00000002 */
#define RCC_APB4RSTSETR_DCMIPPRST                  RCC_APB4RSTSETR_DCMIPPRST_Msk                       /*!< DCMIPP block reset If DCMIPP is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_APB4RSTSETR_DDRPERFMRST_Pos            (8U)
#define RCC_APB4RSTSETR_DDRPERFMRST_Msk            (0x1UL << RCC_APB4RSTSETR_DDRPERFMRST_Pos)           /*!< 0x00000100 */
#define RCC_APB4RSTSETR_DDRPERFMRST                RCC_APB4RSTSETR_DDRPERFMRST_Msk                     /*!< DDRPERFM block reset Set by software. */
#define RCC_APB4RSTSETR_USBPHYRST_Pos              (16U)
#define RCC_APB4RSTSETR_USBPHYRST_Msk              (0x1UL << RCC_APB4RSTSETR_USBPHYRST_Pos)             /*!< 0x00010000 */
#define RCC_APB4RSTSETR_USBPHYRST                  RCC_APB4RSTSETR_USBPHYRST_Msk                       /*!< USBPHYC block reset If USB PHY is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */

/***************  Bit definition for RCC_APB4RSTCLRR register  ****************/
#define RCC_APB4RSTCLRR_LTDCRST_Pos                (0U)
#define RCC_APB4RSTCLRR_LTDCRST_Msk                (0x1UL << RCC_APB4RSTCLRR_LTDCRST_Pos)               /*!< 0x00000001 */
#define RCC_APB4RSTCLRR_LTDCRST                    RCC_APB4RSTCLRR_LTDCRST_Msk                         /*!< LTDC block reset If LTDC is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_APB4RSTCLRR_DCMIPPRST_Pos              (1U)
#define RCC_APB4RSTCLRR_DCMIPPRST_Msk              (0x1UL << RCC_APB4RSTCLRR_DCMIPPRST_Pos)             /*!< 0x00000002 */
#define RCC_APB4RSTCLRR_DCMIPPRST                  RCC_APB4RSTCLRR_DCMIPPRST_Msk                       /*!< DCMIPP block reset If DCMIPP is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_APB4RSTCLRR_DDRPERFMRST_Pos            (8U)
#define RCC_APB4RSTCLRR_DDRPERFMRST_Msk            (0x1UL << RCC_APB4RSTCLRR_DDRPERFMRST_Pos)           /*!< 0x00000100 */
#define RCC_APB4RSTCLRR_DDRPERFMRST                RCC_APB4RSTCLRR_DDRPERFMRST_Msk                     /*!< DDRPERFM block reset Cleared by software. */
#define RCC_APB4RSTCLRR_USBPHYRST_Pos              (16U)
#define RCC_APB4RSTCLRR_USBPHYRST_Msk              (0x1UL << RCC_APB4RSTCLRR_USBPHYRST_Pos)             /*!< 0x00010000 */
#define RCC_APB4RSTCLRR_USBPHYRST                  RCC_APB4RSTCLRR_USBPHYRST_Msk                       /*!< USBPHYC block reset If USB PHY is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */

/***************  Bit definition for RCC_APB5RSTSETR register  ****************/
#define RCC_APB5RSTSETR_STGENRST_Pos               (20U)
#define RCC_APB5RSTSETR_STGENRST_Msk               (0x1UL << RCC_APB5RSTSETR_STGENRST_Pos)              /*!< 0x00100000 */
#define RCC_APB5RSTSETR_STGENRST                   RCC_APB5RSTSETR_STGENRST_Msk                        /*!< STGEN block reset If STGENC (STGEN controller sub-part) is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */

/***************  Bit definition for RCC_APB5RSTCLRR register  ****************/
#define RCC_APB5RSTCLRR_STGENRST_Pos               (20U)
#define RCC_APB5RSTCLRR_STGENRST_Msk               (0x1UL << RCC_APB5RSTCLRR_STGENRST_Pos)              /*!< 0x00100000 */
#define RCC_APB5RSTCLRR_STGENRST                   RCC_APB5RSTCLRR_STGENRST_Msk                        /*!< STGEN block reset If STGENC (STGEN controller sub-part) is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */

