zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp131cxx_ca7.h
/*************  Bit definition for RCC_MP_AHB6LPENSETR register  **************/
#define RCC_MP_AHB6LPENSETR_MCELPEN_Pos            (1U)
#define RCC_MP_AHB6LPENSETR_MCELPEN_Msk            (0x1UL << RCC_MP_AHB6LPENSETR_MCELPEN_Pos)           /*!< 0x00000002 */
#define RCC_MP_AHB6LPENSETR_MCELPEN                RCC_MP_AHB6LPENSETR_MCELPEN_Msk                     /*!< MCE peripheral clocks enable during CSleep mode If MCE is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_AHB6LPENSETR_ETH1CKLPEN_Pos         (7U)
#define RCC_MP_AHB6LPENSETR_ETH1CKLPEN_Msk         (0x1UL << RCC_MP_AHB6LPENSETR_ETH1CKLPEN_Pos)        /*!< 0x00000080 */
#define RCC_MP_AHB6LPENSETR_ETH1CKLPEN             RCC_MP_AHB6LPENSETR_ETH1CKLPEN_Msk                  /*!< Enable of the ETH1 clock generated by the RCC (eth1_ker_ck) If ETH1 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_AHB6LPENSETR_ETH1TXLPEN_Pos         (8U)
#define RCC_MP_AHB6LPENSETR_ETH1TXLPEN_Msk         (0x1UL << RCC_MP_AHB6LPENSETR_ETH1TXLPEN_Pos)        /*!< 0x00000100 */
#define RCC_MP_AHB6LPENSETR_ETH1TXLPEN             RCC_MP_AHB6LPENSETR_ETH1TXLPEN_Msk                  /*!< ETH1 transmission clock enable during CSleep mode If ETH1 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_AHB6LPENSETR_ETH1RXLPEN_Pos         (9U)
#define RCC_MP_AHB6LPENSETR_ETH1RXLPEN_Msk         (0x1UL << RCC_MP_AHB6LPENSETR_ETH1RXLPEN_Pos)        /*!< 0x00000200 */
#define RCC_MP_AHB6LPENSETR_ETH1RXLPEN             RCC_MP_AHB6LPENSETR_ETH1RXLPEN_Msk                  /*!< ETH1 reception clock enable during CSleep mode If ETH1 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_AHB6LPENSETR_ETH1MACLPEN_Pos        (10U)
#define RCC_MP_AHB6LPENSETR_ETH1MACLPEN_Msk        (0x1UL << RCC_MP_AHB6LPENSETR_ETH1MACLPEN_Pos)       /*!< 0x00000400 */
#define RCC_MP_AHB6LPENSETR_ETH1MACLPEN            RCC_MP_AHB6LPENSETR_ETH1MACLPEN_Msk                 /*!< ETH1 MAC bus interface clock enable during CSleep mode (hclk6 and aclk) If ETH1 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_AHB6LPENSETR_ETH1STPEN_Pos          (11U)
#define RCC_MP_AHB6LPENSETR_ETH1STPEN_Msk          (0x1UL << RCC_MP_AHB6LPENSETR_ETH1STPEN_Pos)         /*!< 0x00000800 */
#define RCC_MP_AHB6LPENSETR_ETH1STPEN              RCC_MP_AHB6LPENSETR_ETH1STPEN_Msk                   /*!< ETH1 peripheral clock enable during CStop mode If ETH1 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software in order to allow the ETH1 block to receive from pads ETH1_TX_CLK and ETH1_RX_CLK clocks during CStop. */
#define RCC_MP_AHB6LPENSETR_FMCLPEN_Pos            (12U)
#define RCC_MP_AHB6LPENSETR_FMCLPEN_Msk            (0x1UL << RCC_MP_AHB6LPENSETR_FMCLPEN_Pos)           /*!< 0x00001000 */
#define RCC_MP_AHB6LPENSETR_FMCLPEN                RCC_MP_AHB6LPENSETR_FMCLPEN_Msk                     /*!< FMC peripheral clocks enable during CSleep mode If FMC is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_AHB6LPENSETR_QSPILPEN_Pos           (14U)
#define RCC_MP_AHB6LPENSETR_QSPILPEN_Msk           (0x1UL << RCC_MP_AHB6LPENSETR_QSPILPEN_Pos)          /*!< 0x00004000 */
#define RCC_MP_AHB6LPENSETR_QSPILPEN               RCC_MP_AHB6LPENSETR_QSPILPEN_Msk                    /*!< QUADSPI peripheral clocks enable during CSleep mode If QSPI is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_AHB6LPENSETR_SDMMC1LPEN_Pos         (16U)
#define RCC_MP_AHB6LPENSETR_SDMMC1LPEN_Msk         (0x1UL << RCC_MP_AHB6LPENSETR_SDMMC1LPEN_Pos)        /*!< 0x00010000 */
#define RCC_MP_AHB6LPENSETR_SDMMC1LPEN             RCC_MP_AHB6LPENSETR_SDMMC1LPEN_Msk                  /*!< SDMMC1 and SDMMC1 delay (DLYBSD1) block peripheral clocks enable during CSleep mode If SDMMC1 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_AHB6LPENSETR_SDMMC2LPEN_Pos         (17U)
#define RCC_MP_AHB6LPENSETR_SDMMC2LPEN_Msk         (0x1UL << RCC_MP_AHB6LPENSETR_SDMMC2LPEN_Pos)        /*!< 0x00020000 */
#define RCC_MP_AHB6LPENSETR_SDMMC2LPEN             RCC_MP_AHB6LPENSETR_SDMMC2LPEN_Msk                  /*!< SDMMC2 and SDMMC2 delay (DLYBSD2) block peripheral clocks enable during CSleep mode If SDMMC2 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_AHB6LPENSETR_CRC1LPEN_Pos           (20U)
#define RCC_MP_AHB6LPENSETR_CRC1LPEN_Msk           (0x1UL << RCC_MP_AHB6LPENSETR_CRC1LPEN_Pos)          /*!< 0x00100000 */
#define RCC_MP_AHB6LPENSETR_CRC1LPEN               RCC_MP_AHB6LPENSETR_CRC1LPEN_Msk                    /*!< CRC peripheral clocks enable during CSleep mode Set by software. */
#define RCC_MP_AHB6LPENSETR_USBHLPEN_Pos           (24U)
#define RCC_MP_AHB6LPENSETR_USBHLPEN_Msk           (0x1UL << RCC_MP_AHB6LPENSETR_USBHLPEN_Pos)          /*!< 0x01000000 */
#define RCC_MP_AHB6LPENSETR_USBHLPEN               RCC_MP_AHB6LPENSETR_USBHLPEN_Msk                    /*!< USBH peripheral clocks enable during CSleep mode Set by software. */
#define RCC_MP_AHB6LPENSETR_ETH2CKLPEN_Pos         (27U)
#define RCC_MP_AHB6LPENSETR_ETH2CKLPEN_Msk         (0x1UL << RCC_MP_AHB6LPENSETR_ETH2CKLPEN_Pos)        /*!< 0x08000000 */
#define RCC_MP_AHB6LPENSETR_ETH2CKLPEN             RCC_MP_AHB6LPENSETR_ETH2CKLPEN_Msk                  /*!< Enable of the ETH2 clock generated by the RCC (eth2_ker_ck) If ETH2 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_AHB6LPENSETR_ETH2TXLPEN_Pos         (28U)
#define RCC_MP_AHB6LPENSETR_ETH2TXLPEN_Msk         (0x1UL << RCC_MP_AHB6LPENSETR_ETH2TXLPEN_Pos)        /*!< 0x10000000 */
#define RCC_MP_AHB6LPENSETR_ETH2TXLPEN             RCC_MP_AHB6LPENSETR_ETH2TXLPEN_Msk                  /*!< ETH2 transmission clock enable during CSleep mode If ETH2 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_AHB6LPENSETR_ETH2RXLPEN_Pos         (29U)
#define RCC_MP_AHB6LPENSETR_ETH2RXLPEN_Msk         (0x1UL << RCC_MP_AHB6LPENSETR_ETH2RXLPEN_Pos)        /*!< 0x20000000 */
#define RCC_MP_AHB6LPENSETR_ETH2RXLPEN             RCC_MP_AHB6LPENSETR_ETH2RXLPEN_Msk                  /*!< ETH2 reception clock enable during CSleep mode If ETH2 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_AHB6LPENSETR_ETH2MACLPEN_Pos        (30U)
#define RCC_MP_AHB6LPENSETR_ETH2MACLPEN_Msk        (0x1UL << RCC_MP_AHB6LPENSETR_ETH2MACLPEN_Pos)       /*!< 0x40000000 */
#define RCC_MP_AHB6LPENSETR_ETH2MACLPEN            RCC_MP_AHB6LPENSETR_ETH2MACLPEN_Msk                 /*!< ETH2 MAC bus interface clock enable during CSleep mode (hclk6 and aclk) If ETH2 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_AHB6LPENSETR_ETH2STPEN_Pos          (31U)
#define RCC_MP_AHB6LPENSETR_ETH2STPEN_Msk          (0x1UL << RCC_MP_AHB6LPENSETR_ETH2STPEN_Pos)         /*!< 0x80000000 */
#define RCC_MP_AHB6LPENSETR_ETH2STPEN              RCC_MP_AHB6LPENSETR_ETH2STPEN_Msk                   /*!< ETH2 peripheral clock enable during CStop mode If ETH2 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software in order to allow the ETH2 block to receive from pads ETH2_TX_CLK and ETH2_RX_CLK clocks during CStop. */

