zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp131cxx_ca7.h
/*******************  Bit definition for SWPMI_RDR register  ********************/
#define SWPMI_RDR_RD_Pos         (0U)
#define SWPMI_RDR_RD_Msk         (0xFFFFFFFFUL << SWPMI_RDR_RD_Pos)             /*!< 0xFFFFFFFF */
#define SWPMI_RDR_RD             SWPMI_RDR_RD_Msk                              /*!<Receive Data Register           */


/*******************  Bit definition for SWPMI_OR register  ********************/
#define SWPMI_OR_TBYP            ((uint16_t)0x0001)                            /*!<SWP Transceiver Bypass */
#define SWPMI_OR_CLASS           ((uint16_t)0x0002)                            /*!<SWP CLASS selection */

/******************************************************************************/
/*                                                                            */
/*                                       USB_OTG                              */
/*                                                                            */
/******************************************************************************/
/*****************  Bit definition for USB_OTG_GOTGCTL register  ******************/
#define USB_OTG_GOTGCTL_SRQSCS_Pos             (0U)
#define USB_OTG_GOTGCTL_SRQSCS_Msk             (0x1UL << USB_OTG_GOTGCTL_SRQSCS_Pos)        /*!< 0x00000001 */
#define USB_OTG_GOTGCTL_SRQSCS                 USB_OTG_GOTGCTL_SRQSCS_Msk                  /*!< Session request success */
#define USB_OTG_GOTGCTL_SRQ_Pos                (1U)
#define USB_OTG_GOTGCTL_SRQ_Msk                (0x1UL << USB_OTG_GOTGCTL_SRQ_Pos)           /*!< 0x00000002 */
#define USB_OTG_GOTGCTL_SRQ                    USB_OTG_GOTGCTL_SRQ_Msk                     /*!< Session request */
#define USB_OTG_GOTGCTL_VBVALOEN_Pos           (2U)
#define USB_OTG_GOTGCTL_VBVALOEN_Msk           (0x1UL << USB_OTG_GOTGCTL_VBVALOEN_Pos)      /*!< 0x00000004 */
#define USB_OTG_GOTGCTL_VBVALOEN               USB_OTG_GOTGCTL_VBVALOEN_Msk                /*!< VBUS valid override enable */
#define USB_OTG_GOTGCTL_VBVALOVAL_Pos          (3U)
#define USB_OTG_GOTGCTL_VBVALOVAL_Msk          (0x1UL << USB_OTG_GOTGCTL_VBVALOVAL_Pos)     /*!< 0x00000008 */
#define USB_OTG_GOTGCTL_VBVALOVAL              USB_OTG_GOTGCTL_VBVALOVAL_Msk               /*!< VBUS valid override value */
#define USB_OTG_GOTGCTL_AVALOEN_Pos            (4U)
#define USB_OTG_GOTGCTL_AVALOEN_Msk            (0x1UL << USB_OTG_GOTGCTL_AVALOEN_Pos)       /*!< 0x00000010 */
#define USB_OTG_GOTGCTL_AVALOEN                USB_OTG_GOTGCTL_AVALOEN_Msk                 /*!< A-peripheral session valid override enable */
#define USB_OTG_GOTGCTL_AVALOVAL_Pos           (5U)
#define USB_OTG_GOTGCTL_AVALOVAL_Msk           (0x1UL << USB_OTG_GOTGCTL_AVALOVAL_Pos)      /*!< 0x00000020 */
#define USB_OTG_GOTGCTL_AVALOVAL               USB_OTG_GOTGCTL_AVALOVAL_Msk                /*!< A-peripheral session valid override value */
#define USB_OTG_GOTGCTL_BVALOEN_Pos            (6U)
#define USB_OTG_GOTGCTL_BVALOEN_Msk            (0x1UL << USB_OTG_GOTGCTL_BVALOEN_Pos)       /*!< 0x00000040 */
#define USB_OTG_GOTGCTL_BVALOEN                USB_OTG_GOTGCTL_BVALOEN_Msk                 /*!< B-peripheral session valid override enable */
#define USB_OTG_GOTGCTL_BVALOVAL_Pos           (7U)
#define USB_OTG_GOTGCTL_BVALOVAL_Msk           (0x1UL << USB_OTG_GOTGCTL_BVALOVAL_Pos)      /*!< 0x00000080 */
#define USB_OTG_GOTGCTL_BVALOVAL               USB_OTG_GOTGCTL_BVALOVAL_Msk                /*!< B-peripheral session valid override value */
#define USB_OTG_GOTGCTL_HNGSCS_Pos             (8U)
#define USB_OTG_GOTGCTL_HNGSCS_Msk             (0x1UL << USB_OTG_GOTGCTL_HNGSCS_Pos)        /*!< 0x00000100 */
#define USB_OTG_GOTGCTL_HNGSCS                 USB_OTG_GOTGCTL_HNGSCS_Msk                  /*!< Host negotiation success */
#define USB_OTG_GOTGCTL_HNPRQ_Pos              (9U)
#define USB_OTG_GOTGCTL_HNPRQ_Msk              (0x1UL << USB_OTG_GOTGCTL_HNPRQ_Pos)         /*!< 0x00000200 */
#define USB_OTG_GOTGCTL_HNPRQ                  USB_OTG_GOTGCTL_HNPRQ_Msk                   /*!< HNP request */
#define USB_OTG_GOTGCTL_HSHNPEN_Pos            (10U)
#define USB_OTG_GOTGCTL_HSHNPEN_Msk            (0x1UL << USB_OTG_GOTGCTL_HSHNPEN_Pos)       /*!< 0x00000400 */
#define USB_OTG_GOTGCTL_HSHNPEN                USB_OTG_GOTGCTL_HSHNPEN_Msk                 /*!< host set HNP enable */
#define USB_OTG_GOTGCTL_DHNPEN_Pos             (11U)
#define USB_OTG_GOTGCTL_DHNPEN_Msk             (0x1UL << USB_OTG_GOTGCTL_DHNPEN_Pos)        /*!< 0x00000800 */
#define USB_OTG_GOTGCTL_DHNPEN                 USB_OTG_GOTGCTL_DHNPEN_Msk                  /*!< Device HNP enabled */
#define USB_OTG_GOTGCTL_EHEN_Pos               (12U)
#define USB_OTG_GOTGCTL_EHEN_Msk               (0x1UL << USB_OTG_GOTGCTL_EHEN_Pos)          /*!< 0x00001000 */
#define USB_OTG_GOTGCTL_EHEN                   USB_OTG_GOTGCTL_EHEN_Msk                    /*!< Embedded host enable */
#define USB_OTG_GOTGCTL_CIDSTS_Pos             (16U)
#define USB_OTG_GOTGCTL_CIDSTS_Msk             (0x1UL << USB_OTG_GOTGCTL_CIDSTS_Pos)        /*!< 0x00010000 */
#define USB_OTG_GOTGCTL_CIDSTS                 USB_OTG_GOTGCTL_CIDSTS_Msk                  /*!< Connector ID status */
#define USB_OTG_GOTGCTL_DBCT_Pos               (17U)
#define USB_OTG_GOTGCTL_DBCT_Msk               (0x1UL << USB_OTG_GOTGCTL_DBCT_Pos)          /*!< 0x00020000 */
#define USB_OTG_GOTGCTL_DBCT                   USB_OTG_GOTGCTL_DBCT_Msk                    /*!< Long/short debounce time */
#define USB_OTG_GOTGCTL_ASVLD_Pos              (18U)
#define USB_OTG_GOTGCTL_ASVLD_Msk              (0x1UL << USB_OTG_GOTGCTL_ASVLD_Pos)         /*!< 0x00040000 */
#define USB_OTG_GOTGCTL_ASVLD                  USB_OTG_GOTGCTL_ASVLD_Msk                   /*!< A-session valid */
#define USB_OTG_GOTGCTL_BSVLD_Pos              (19U)
#define USB_OTG_GOTGCTL_BSVLD_Msk              (0x1UL << USB_OTG_GOTGCTL_BSVLD_Pos)         /*!< 0x00080000 */
#define USB_OTG_GOTGCTL_BSVLD                  USB_OTG_GOTGCTL_BSVLD_Msk                   /*!< B-session valid */
#define USB_OTG_GOTGCTL_OTGVER_Pos             (20U)
#define USB_OTG_GOTGCTL_OTGVER_Msk             (0x1UL << USB_OTG_GOTGCTL_OTGVER_Pos)        /*!< 0x00100000 */
#define USB_OTG_GOTGCTL_OTGVER                 USB_OTG_GOTGCTL_OTGVER_Msk                  /*!< OTG version */
#define USB_OTG_GOTGCTL_CURMOD_Pos             (21U)
#define USB_OTG_GOTGCTL_CURMOD_Msk             (0x1UL << USB_OTG_GOTGCTL_CURMOD_Pos)        /*!< 0x00200000 */
#define USB_OTG_GOTGCTL_CURMOD                 USB_OTG_GOTGCTL_CURMOD_Msk                  /*!< Current mode of operation */

/********************  Bit definition for USB_OTG_HCFG register  ********************/

#define USB_OTG_HCFG_FSLSPCS_Pos                 (0U)
#define USB_OTG_HCFG_FSLSPCS_Msk                 (0x3UL << USB_OTG_HCFG_FSLSPCS_Pos) /*!< 0x00000003 */
#define USB_OTG_HCFG_FSLSPCS                     USB_OTG_HCFG_FSLSPCS_Msk      /*!< FS/LS PHY clock select  */
#define USB_OTG_HCFG_FSLSPCS_0                   (0x1UL << USB_OTG_HCFG_FSLSPCS_Pos) /*!< 0x00000001 */
#define USB_OTG_HCFG_FSLSPCS_1                   (0x2UL << USB_OTG_HCFG_FSLSPCS_Pos) /*!< 0x00000002 */
#define USB_OTG_HCFG_FSLSS_Pos                   (2U)
#define USB_OTG_HCFG_FSLSS_Msk                   (0x1UL << USB_OTG_HCFG_FSLSS_Pos) /*!< 0x00000004 */
#define USB_OTG_HCFG_FSLSS                       USB_OTG_HCFG_FSLSS_Msk        /*!< FS- and LS-only support */

/********************  Bit definition for USB_OTG_DCFG register  ********************/

#define USB_OTG_DCFG_DSPD_Pos                    (0U)
#define USB_OTG_DCFG_DSPD_Msk                    (0x3UL << USB_OTG_DCFG_DSPD_Pos) /*!< 0x00000003 */
#define USB_OTG_DCFG_DSPD                        USB_OTG_DCFG_DSPD_Msk         /*!< Device speed */
#define USB_OTG_DCFG_DSPD_0                      (0x1UL << USB_OTG_DCFG_DSPD_Pos) /*!< 0x00000001 */
#define USB_OTG_DCFG_DSPD_1                      (0x2UL << USB_OTG_DCFG_DSPD_Pos) /*!< 0x00000002 */
#define USB_OTG_DCFG_NZLSOHSK_Pos                (2U)
#define USB_OTG_DCFG_NZLSOHSK_Msk                (0x1UL << USB_OTG_DCFG_NZLSOHSK_Pos) /*!< 0x00000004 */
#define USB_OTG_DCFG_NZLSOHSK                    USB_OTG_DCFG_NZLSOHSK_Msk     /*!< Nonzero-length status OUT handshake */

#define USB_OTG_DCFG_DAD_Pos                     (4U)
#define USB_OTG_DCFG_DAD_Msk                     (0x7FUL << USB_OTG_DCFG_DAD_Pos) /*!< 0x000007F0 */
#define USB_OTG_DCFG_DAD                         USB_OTG_DCFG_DAD_Msk          /*!< Device address */
#define USB_OTG_DCFG_DAD_0                       (0x01UL << USB_OTG_DCFG_DAD_Pos) /*!< 0x00000010 */
#define USB_OTG_DCFG_DAD_1                       (0x02UL << USB_OTG_DCFG_DAD_Pos) /*!< 0x00000020 */
#define USB_OTG_DCFG_DAD_2                       (0x04UL << USB_OTG_DCFG_DAD_Pos) /*!< 0x00000040 */
#define USB_OTG_DCFG_DAD_3                       (0x08UL << USB_OTG_DCFG_DAD_Pos) /*!< 0x00000080 */
#define USB_OTG_DCFG_DAD_4                       (0x10UL << USB_OTG_DCFG_DAD_Pos) /*!< 0x00000100 */
#define USB_OTG_DCFG_DAD_5                       (0x20UL << USB_OTG_DCFG_DAD_Pos) /*!< 0x00000200 */
#define USB_OTG_DCFG_DAD_6                       (0x40UL << USB_OTG_DCFG_DAD_Pos) /*!< 0x00000400 */

#define USB_OTG_DCFG_PFIVL_Pos                   (11U)
#define USB_OTG_DCFG_PFIVL_Msk                   (0x3UL << USB_OTG_DCFG_PFIVL_Pos) /*!< 0x00001800 */
#define USB_OTG_DCFG_PFIVL                       USB_OTG_DCFG_PFIVL_Msk        /*!< Periodic (micro)frame interval */
#define USB_OTG_DCFG_PFIVL_0                     (0x1UL << USB_OTG_DCFG_PFIVL_Pos) /*!< 0x00000800 */
#define USB_OTG_DCFG_PFIVL_1                     (0x2UL << USB_OTG_DCFG_PFIVL_Pos) /*!< 0x00001000 */

#define USB_OTG_DCFG_PERSCHIVL_Pos               (24U)
#define USB_OTG_DCFG_PERSCHIVL_Msk               (0x3UL << USB_OTG_DCFG_PERSCHIVL_Pos) /*!< 0x03000000 */
#define USB_OTG_DCFG_PERSCHIVL                   USB_OTG_DCFG_PERSCHIVL_Msk    /*!< Periodic scheduling interval */
#define USB_OTG_DCFG_PERSCHIVL_0                 (0x1UL << USB_OTG_DCFG_PERSCHIVL_Pos) /*!< 0x01000000 */
#define USB_OTG_DCFG_PERSCHIVL_1                 (0x2UL << USB_OTG_DCFG_PERSCHIVL_Pos) /*!< 0x02000000 */


/*****************  Bit definition for USB_OTG_GOTGINT register  ******************/
#define USB_OTG_GOTGINT_SEDET_Pos              (2U)
#define USB_OTG_GOTGINT_SEDET_Msk              (0x1UL << USB_OTG_GOTGINT_SEDET_Pos)         /*!< 0x00000004 */
#define USB_OTG_GOTGINT_SEDET                  USB_OTG_GOTGINT_SEDET_Msk                   /*!< Session end detected */
#define USB_OTG_GOTGINT_SRSSCHG_Pos            (8U)
#define USB_OTG_GOTGINT_SRSSCHG_Msk            (0x1UL << USB_OTG_GOTGINT_SRSSCHG_Pos)       /*!< 0x00000100 */
#define USB_OTG_GOTGINT_SRSSCHG                USB_OTG_GOTGINT_SRSSCHG_Msk                 /*!< Session request success status change */
#define USB_OTG_GOTGINT_HNSSCHG_Pos            (9U)
#define USB_OTG_GOTGINT_HNSSCHG_Msk            (0x1UL << USB_OTG_GOTGINT_HNSSCHG_Pos)       /*!< 0x00000200 */
#define USB_OTG_GOTGINT_HNSSCHG                USB_OTG_GOTGINT_HNSSCHG_Msk                 /*!< Host negotiation success status change */
#define USB_OTG_GOTGINT_HNGDET_Pos             (17U)
#define USB_OTG_GOTGINT_HNGDET_Msk             (0x1UL << USB_OTG_GOTGINT_HNGDET_Pos)        /*!< 0x00020000 */
#define USB_OTG_GOTGINT_HNGDET                 USB_OTG_GOTGINT_HNGDET_Msk                  /*!< Host negotiation detected */
#define USB_OTG_GOTGINT_ADTOCHG_Pos            (18U)
#define USB_OTG_GOTGINT_ADTOCHG_Msk            (0x1UL << USB_OTG_GOTGINT_ADTOCHG_Pos)       /*!< 0x00040000 */
#define USB_OTG_GOTGINT_ADTOCHG                USB_OTG_GOTGINT_ADTOCHG_Msk                 /*!< A-device timeout change */
#define USB_OTG_GOTGINT_DBCDNE_Pos             (19U)
#define USB_OTG_GOTGINT_DBCDNE_Msk             (0x1UL << USB_OTG_GOTGINT_DBCDNE_Pos)        /*!< 0x00080000 */
#define USB_OTG_GOTGINT_DBCDNE                 USB_OTG_GOTGINT_DBCDNE_Msk                  /*!< Debounce done */

