zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp131cxx_ca7.h
/****************  Bit definition for ETZPC_HWCFGR register ****************/
#define ETZPC_HWCFGR_NUM_TZMA_Pos             (0U)
#define ETZPC_HWCFGR_NUM_TZMA_Msk             (0xFFUL << ETZPC_HWCFGR_NUM_TZMA_Pos) /*!< Number of TZMA instances */
#define ETZPC_HWCFGR_NUM_TZMA                 ETZPC_HWCFGR_NUM_TZMA_Msk
#define ETZPC_HWCFGR_NUM_PER_SEC_Pos          (8U)
#define ETZPC_HWCFGR_NUM_PER_SEC_Msk          (0xFFUL << ETZPC_HWCFGR_NUM_PER_SEC_Pos) /*!< Number of securable peripherals */
#define ETZPC_HWCFGR_NUM_PER_SEC              ETZPC_HWCFGR_NUM_PER_SEC_Msk
#define ETZPC_HWCFGR_NUM_AHB_SEC_Pos          (16U)
#define ETZPC_HWCFGR_NUM_AHB_SEC_Msk          (0xFFUL << ETZPC_HWCFGR_NUM_AHB_SEC_Pos) /*!< Number of securable AHB masters */
#define ETZPC_HWCFGR_NUM_AHB_SEC              ETZPC_HWCFGR_NUM_AHB_SEC_Msk
#define ETZPC_HWCFGR_CHUNKS1N4_Pos            (24U)
#define ETZPC_HWCFGR_CHUNKS1N4_Msk            (0xFFUL << ETZPC_HWCFGR_CHUNKS1N4_Pos) /*!< TZMA size steps */
#define ETZPC_HWCFGR_CHUNKS1N4_4K             (0x0UL << ETZPC_HWCFGR_CHUNKS1N4_Pos) /*!< 4 Kbytes step */
#define ETZPC_HWCFGR_CHUNKS1N4_1K             (0x1UL << ETZPC_HWCFGR_CHUNKS1N4_Pos) /*!< 1 Kbytes step */


/****************  Bit definition for ETZPC_VERR register ****************/
#define ETZPC_VERR_MINREV_Pos                 (0U)
#define ETZPC_VERR_MINREV_Msk                 (0xFUL << ETZPC_VERR_MINREV_Pos) /*!< Minor revision */
#define ETZPC_VERR_MINREV                     ETZPC_VERR_MINREV_Msk
#define ETZPC_VERR_MAJREV_Pos                 (4U)
#define ETZPC_VERR_MAJREV_Msk                 (0xFUL << ETZPC_VERR_MAJREV_Pos) /*!< Major revision */
#define ETZPC_VERR_MAJREV                     ETZPC_VERR_MAJREV_Msk


/**
  * @}
  */

/**
  * @}
  */

/** @addtogroup Exported_macros
  * @{
  */
/******************************* ADC Instances ********************************/
#define IS_ADC_ALL_INSTANCE(INSTANCE) ((INSTANCE) == ADC2)                                    

#define IS_ADC_MULTIMODE_MASTER_INSTANCE(INSTANCE) ((INSTANCE) == ADC2)
/******************************** DTS Instances ******************************/
#define IS_DTS_ALL_INSTANCE(INSTANCE) ((INSTANCE) == DTS1)


/******************************* CRC Instances ********************************/
#define IS_CRC_ALL_INSTANCE(INSTANCE) (((INSTANCE) == CRC1))

/****************************** DFSDM Instances *******************************/
#define IS_DFSDM_FILTER_ALL_INSTANCE(INSTANCE) (((INSTANCE) == DFSDM1_Filter0) || \
                                         ((INSTANCE) == DFSDM1_Filter1))

#define IS_DFSDM_CHANNEL_ALL_INSTANCE(INSTANCE) (((INSTANCE) == DFSDM1_Channel0) || \
                                                 ((INSTANCE) == DFSDM1_Channel1) || \
                                                 ((INSTANCE) == DFSDM1_Channel2) || \
                                                 ((INSTANCE) == DFSDM1_Channel3))

/******************************** DMA Instances *******************************/
#define IS_DMA_STREAM_ALL_INSTANCE(INSTANCE) (((INSTANCE) == DMA1_Stream0) || \
                                             ((INSTANCE) == DMA1_Stream1) || \
                                             ((INSTANCE) == DMA1_Stream2) || \
                                             ((INSTANCE) == DMA1_Stream3) || \
                                             ((INSTANCE) == DMA1_Stream4) || \
                                             ((INSTANCE) == DMA1_Stream5) || \
                                             ((INSTANCE) == DMA1_Stream6) || \
                                             ((INSTANCE) == DMA1_Stream7) || \
                                             ((INSTANCE) == DMA2_Stream0) || \
                                             ((INSTANCE) == DMA2_Stream1) || \
                                             ((INSTANCE) == DMA2_Stream2) || \
                                             ((INSTANCE) == DMA2_Stream3) || \
                                             ((INSTANCE) == DMA2_Stream4) || \
                                             ((INSTANCE) == DMA2_Stream5) || \
                                             ((INSTANCE) == DMA2_Stream6) || \
                                             ((INSTANCE) == DMA2_Stream7) || \
                                             ((INSTANCE) == DMA3_Stream0) || \
                                             ((INSTANCE) == DMA3_Stream1) || \
                                             ((INSTANCE) == DMA3_Stream2) || \
                                             ((INSTANCE) == DMA3_Stream3) || \
                                             ((INSTANCE) == DMA3_Stream4) || \
                                             ((INSTANCE) == DMA3_Stream5) || \
                                             ((INSTANCE) == DMA3_Stream6) || \
                                             ((INSTANCE) == DMA3_Stream7))

/******************************** DMA Request Generator Instances **************/
#define IS_DMA_REQUEST_GEN_ALL_INSTANCE(INSTANCE) (((INSTANCE) == DMAMUX1_RequestGenerator0) || \
                                                   ((INSTANCE) == DMAMUX1_RequestGenerator1) || \
                                                   ((INSTANCE) == DMAMUX1_RequestGenerator2) || \
                                                   ((INSTANCE) == DMAMUX1_RequestGenerator3) || \
                                                   ((INSTANCE) == DMAMUX2_RequestGenerator0) || \
                                                   ((INSTANCE) == DMAMUX2_RequestGenerator1) || \
                                                   ((INSTANCE) == DMAMUX2_RequestGenerator2) || \
                                                   ((INSTANCE) == DMAMUX2_RequestGenerator3))
/******************************** MDMA Request Generator Instances **************/
#define IS_MDMA_STREAM_ALL_INSTANCE(INSTANCE) (((INSTANCE) == MDMA_Channel0) || \
                                               ((INSTANCE) == MDMA_Channel1) || \
                                               ((INSTANCE) == MDMA_Channel2) || \
                                               ((INSTANCE) == MDMA_Channel3) || \
                                               ((INSTANCE) == MDMA_Channel4) || \
                                               ((INSTANCE) == MDMA_Channel5) || \
                                               ((INSTANCE) == MDMA_Channel6) || \
                                               ((INSTANCE) == MDMA_Channel7) || \
                                               ((INSTANCE) == MDMA_Channel8) || \
                                               ((INSTANCE) == MDMA_Channel9)  || \
                                               ((INSTANCE) == MDMA_Channel10) || \
                                               ((INSTANCE) == MDMA_Channel11) || \
                                               ((INSTANCE) == MDMA_Channel12) || \
                                               ((INSTANCE) == MDMA_Channel13) || \
                                               ((INSTANCE) == MDMA_Channel14) || \
                                               ((INSTANCE) == MDMA_Channel15) || \
                                               ((INSTANCE) == MDMA_Channel16) || \
                                               ((INSTANCE) == MDMA_Channel17) || \
                                               ((INSTANCE) == MDMA_Channel18) || \
                                               ((INSTANCE) == MDMA_Channel19) || \
                                               ((INSTANCE) == MDMA_Channel20) || \
                                               ((INSTANCE) == MDMA_Channel21) || \
                                               ((INSTANCE) == MDMA_Channel22) || \
                                               ((INSTANCE) == MDMA_Channel23) || \
                                               ((INSTANCE) == MDMA_Channel24) || \
                                               ((INSTANCE) == MDMA_Channel25) || \
                                               ((INSTANCE) == MDMA_Channel26) || \
                                               ((INSTANCE) == MDMA_Channel27) || \
                                               ((INSTANCE) == MDMA_Channel28) || \
                                               ((INSTANCE) == MDMA_Channel29) || \
                                               ((INSTANCE) == MDMA_Channel30) || \
                                               ((INSTANCE) == MDMA_Channel31))
/******************************* QUADSPI Instances *******************************/
#define IS_QSPI_ALL_INSTANCE(INSTANCE) ((INSTANCE) == QUADSPI)


